{
  "url": "https://gorillazforbeginners.com/phase-1/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2018/10/phase-1-logo.jpg?w=898",
    "https://gorillazforbeginners.files.wordpress.com/2019/06/phase-1.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/phase-1-art.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/09/gorillaz-mobil.jpg?w=912",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/gorillaz-vs-daft-punk.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/nokia-phone-case.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/05/hitclips.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/11/art-asylum.jpg?w=332",
    "https://gorillazforbeginners.files.wordpress.com/2019/09/zombie-kong.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/sebastian-jacob-niccals.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/04/murdoc-as-a-child.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/05/burning-sensations.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/2d-as-a-child.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/russels-whacky-spirits.png?w=227",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/hip-hop-machine.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/d-day.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/paula-cracker.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/whiffy-smiffy.png?w=364",
    "https://gorillazforbeginners.files.wordpress.com/2019/06/murdocs-winnebago.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/dr-wurzel.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/06/gorilla.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/11/live-in-mexico.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/celebrity-harvest.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/the-break-up.png"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nPhase 1\nCELEBRITY TAKEDOWN\n2000-2002\n\nHistory | Tours | Lore\n\nDuring the humble beginnings, Gorillaz were seen by many as nothing more than a comedic novelty act; a gimmick that was taking a generalised potshot at the industry it was partaking in, with seemingly little insight relative to current affairs or political movements (something that would greatly contrast later phases). The entire concept had spawned from Damon Albarn & Jamie Hewlett, who’d both been faced with personal dilemmas through their own lives around this time. Damon had broken up with Justine Frischmann, whilst Jamie was taking heat after the Tank Girl movie had (ahem) tanked at the box office. The pair ended up living together in a flat in 1998 after facing these problems, and would whittle away days upon days watching MTV; until the penny dropped that no matter what would come on, nothing shown ever had substance. The decision was made to substitute all of this with a band who could speak on several greater volumes than the Pop artists of the time, and to accomplish this with a group who weren’t actually there to take any credit for their work, Gorillaz.\n\nAfter two years of development, recording songs in Jamaica, creating countless publicity images (with animation by Passion Pictures) and recording voice actors to assume the roles of each band member, Gorillaz would become known in November 2000 with their debut EP, Tomorrow Comes Today, a music video to go with the title track & an appearance on the cover of the fashion magazine Dazed & Confused. Their popularity would skyrocket four months later with their first single, Clint Eastwood; which was followed shortly by a Hijack on Xfm radio show, their first public live performance at London’s Kings Cross Scala & their self-titled studio album.\n\nGorillaz soon began branching out globally, playing live abroad and breaking America with their album; leading to six million copies being sold worldwide. Their success began a wave of slogans they’d use across their work, including:\n\nDark Pop\nGorillaz Mobile\nHip-Hop Hard Man\nIrrepressible, Irresistable\nKiddie-Frightener\nLo-Fi Thriller\nShoot to Ill\nZombie Hiphop\nZombies and Painkillers\n\nGorillaz were soon given the opportunity to anonymously make a remix of L’amour est un oiseau rebelle (originally listed as the “20,000 Leagues Mix”) for an MTV competition in which people had to guess which producers did which remixes of the aria. Around this time, the group started touring Japan where their popularity was shockingly lower than most people had expected, with the album failing to sell due to a…rather uncomfortable marketing campaign.\n\nTo combat this, Gorillaz released a Japan-only compilation to boost their sales in the east; aiming to reach the regional success they’d originally intended. G Sides would eventually be released globally, as the decision to group their lesser known songs together was too good an idea to waste for parts of the world where they already had a following. The band would continue travelling, landing a collaboration with D12 in response to 9/11, which kickstarted their lean towards politically charged music; planting the seeds for Demon Days.\n\nBizarrely, the French Electronic duo Daft Punk would aid Gorillaz through marketing throughout 2001 in what seemed like a friendly rivalry between the two groups. Taiwan had promotional CD’s that advertised them both, Toonami would host a Midnight Run marathon of all their animated videos, in some countries, Daft Punk’s Discovery album would include adverts for Gorillaz in the CD case and eventually, Daft Punk performed with Gorillaz & several other artists for a fundraising event at Fabric.\n\nGorillaz would widen their pool of media with a series of animated shorts for MTV known as Gorillabitez; one of these saw the band’s lead singer being depicted as an advocate for the Free Tibet Campaign. The group’s TV appearances would continue near the end of 2001 with a Channel 4 mockumentary titled Charts of Darkness, which jokingly delved into how Gorillaz was created. They also got merchandise, including Nokia phone cases & a HitClips cartridge for Clint Eastwood.\n\nThe next year would see Gorillaz perform at the BRIT Awards, with the cartoon members appearing on stage for the first time; along with Phi Life Cypher. Following this came a contest to win the UK’s first Xbox, a US tour, a remix album by another cartoon band, a collector’s card from a series of cards for various artists in the Metro Silicon Valley newspaper, plans for a movie with DreamWorks titled Celebrity Harvest & a toyline of the band (plus a zombie gorilla) by Art Asylum; sadly, neither of the latter two saw the light of day.\n\nGorillaz also had their own densely crafted website, which gave fans the opportunity to visit the band’s fictional HQ, Kong Studios; as well as playing flash games, mixing their music & chatting with the band members. The band also got a TV game via Sky Digital’s PlayJam network titled Zombie Kong.\n\nPhase 1’s legacy was strong enough to warrant an anniversary compilation titled Gorillaz: 20th Anniversary Super Deluxe Vinyl Boxset & a range of designer CaSuMi chairs for young children crafted by West Town; both were released in 2021.\n\nWhile Phase 1 wasn’t seen with the same sincerity as later periods of their career, Gorillaz had still quickly gained a die-hard following worldwide, making a unique style of music that had been coined as “Zombie Hip-Hop”; intertwining this with the surreal comedy of their videos and presenting themselves much more professionally than any cartoon musicians that had come before (or even since). By the end of Phase 1, the band had won three Billboard VMA’s for Clint Eastwood (“Maximum Vision Award”, “Best Modern Rock New Artist Clip” & “Best Rap/Hip-Hop New Artist Clip”), two EMA’s for “Best Dance” & “Best Song” (Clint Eastwood) & a Q Award for “Best Video” (Clint Eastwood).\n\nTOURS\n\nSupporting acts: Dan the Automator\n\nThe early Gorillaz live shows were interesting, as the performers would do each gig behind a giant screen, allowing them to act as they wanted without ever distracting their audience from the on-screen visuals. The band’s voice actors would also be with the live ensemble to speak as the cartoon members between songs; bizarrely, they would sometimes even play Gorillabitez during these gigs as well.\n\nThe live band:\n\nKeyboards: Mike Smith\nGuitar: Simon Katz\nBass: Junior Dan (2001) & Roberto Occhipinti (2002)\nDrums: Cass Browne\nTurntables: Darren Galea\nLORE\n\nBorn on 6/6/66 in Stoke-on-Trent, Murdoc Alphonce Niccals was found as a baby on the doorstep of his father, Sebastian Jacob Niccals (or Jacob Sebastian Niccals). Rather than seeing his son as…well, a son. Sebastian would take advantage of the child, hurling him into whatever situations he could for get-rich-quick opportunities; the most infamous for Murdoc being the local Are-You-A-Star? talent contest, Murdoc saw these types of shows as nothing more than desperate and embarrassing. This was what encouraged him to make a name for himself without any direction or higher-ups telling him what to do, fuelling the drive he still has with Gorillaz to this day.\n\nMurdoc would often attend his school, Sodsworth Comprehensive, reeking of whiskey and causing chaos by being the class clown as opposed to learning anything. However, his life was changed forever when a skin-headed school bully by the name of Tony Chopper made him crack after countless insults had been hurled day after day. Murdoc retaliated with a harsh, witty remark that led to Chopper breaking his nose, giving it the first of a stunning amount of fractures. From this day, Murdoc had found a new level of confidence; and a new outlook on how to get through life.\n\nMurdoc would spend his teenage years committing crime after crime, whilst discovering a love for artists such as Black Sabbath, The Clash, Dio & various other artists introduced to him by his brother, Hannibal; who broke Murdoc’s nose two times for playing We Rock on his personal turntable (oddly, Dio don’t have an album called “We Rock”, but it’s what Rise of the Ogre says, so…). After graduating Sodsworth with one qualification (International Baccalaureate in Anti-Social Anthropology), Murdoc changed his middle name to Faust as part of an agreement with Satan to let him make the world’s greatest band (something he also did to try winning Kelly O’Driscoll’s heart).\n\nMurdoc was also gifted his own bass guitar, “El Diablo” as part of the deal, but a majority of the bands he put together ended up failing (he insists that none of them failed because he was on vocals); some of the bands he started included The Burning Sensations, Hitler’s Ballgag, Wild Willy Wally and the Wallingtons, The Stupid Name Gang & This Show Has Been Cancelled (later renamed We Have Split Up, because nobody went to any of their gigs; lord knows why). Because of this chain of failures, he ended up jumping from job to job to afford his rent, including gravedigger, soup-seller & part-time mall Santa. Eventually, at 31, Murdoc decided that he needed a better vocalist if he was ever going to go somewhere with his music, beginning his “masterplan”…\n\nIn Crawley New Town, Stuart Pot was a boy with a (mostly) uneventful childhood; he was well-mannered, despite being a few bricks shy of a load (the latter quality being common amongst Crawley residents). One of Stu’s favourite things growing up was watching horror films, such as Dawn of the Dead, The Exorcist & The Texas Chain Saw Massacre, zombie movies being the ones he enjoyed the most. He also enjoyed musicians such as The Jam, Buzzcocks and his favourite group, The Human League. Stu managed to achieve good grades at St Wilfred’s school, despite not having any real ambition or major life goals he wanted to achieve.\n\nWhen Stu was 11, he fell out of a tree; this somehow caused all the hair on his body to fall out, growing back in a new natural blue colour. His father, David (former family name being Tusspot), worked at a fairground tinkering with the electronics and would often make custom keyboards for Stu to experiment with. His mother, Rachel, was a nurse who supplied her son with painkillers due to frequent migraine attacks that would only worsen over the years. Eventually, Stu would find a job at Uncle Norm’s Organ Emporium; and at 19, his life would be driven in an entirely new direction…\n\nMeanwhile, across the pond in Brooklyn, a young well-spoken Hip Hop Hardman named Russel Hobbs was faced with a monumental series of tussles with the undead. Firstly, the time when he and his friends were gunned down by a black Humvee outside a 7-Eleven; Russel was the only survivor, and noticed that one of the Humvee shooters was in fact the Grim Reaper. The spirits of all his dead friends then went inside Russel, including Del, who would become a guest artist on two Gorillaz singles years later. The possession permanently turned Russel’s eyes completely white, along with giving him his musical skills; making him known as “The Rhythm King”.\n\nUnfortunately, a demon had also decided to use Russel’s body as a host, causing him to grow twice his size one night and rampage through the dorms of the private school he attended, The Xavier School for Young Achievers. While having no recollection of this event, he was expelled; and the anxiety put him in a coma for four years. Eventually, a priest visited to exorcise the demon, waking Russel as he then moved to a new school, Brooklyn High. From here, he was able to learn countless things about Hip Hop, giving him a new lease on life.\n\nHowever, Russel’s parents had him shipped to England to live with his uncle in Belsize Park, the most notable item he brought with him would become a crucial instrument to Gorillaz, the Hip Hop Machine, which contained every kind of beat you could imagine.\n\nRussel then got a job at Big Rick Black’s Record Shack, where he became a local legend for his knowledge of beats and grooves; hoping he could go on to live a happy life without anymore chaos (what do you honestly think is going to happen?).\n\nOn the 15th of August 1997, “D-Day” would take place, where Murdoc prepared to enact his plan for stardom. Step 1: Smash into a keyboard shop to steal equipment. Step 2: ? Step 3: Profit. If he’d picked anywhere other than Uncle Norm’s Organ Emporium to raid, there’s no way this disaster would’ve ended in the same way; as Stu-Pot was working there that day. The Vauxhall Astra collided with Stu’s face, putting him in a vegetative state and giving him 8-ball hyphema in his right eye. Murdoc was promptly arrested and given a thirty thousand hour community service sentence, ten hours of each week spent looking after the limp Stu.\n\nMurdoc would spend these ten hours doing all the best things he could think of with the poor kid, punching, kicking, dunking, stunt driving with Stu bumping around in the back, until the day Murdoc wanted to impress a bird by doing donuts in a Nottingham car park. Being the hellraiser without any moral fibre he naturally is, Murdoc crashed the car; firing Stu through the windscreen. After flying 70 mph, landing face first onto tarmac and skidding half a mile across the ground, Stu miraculously recovered! At the cost of his other eye, he stood up with a “pretty boy” look that immediately convinced Murdoc to take him in as the frontman for his next band. Stu was also given a new nickname based on this incident, “2D”, after the two dents in his eyes that turned them black (changing to white whenever he feels like it).\n\nOne year later, Murdoc took the next step in his plan, acquiring a personal HQ for his band, a building on an Essex hilltop known as Kong Studios. The location being widely known for supernatural occurrences, as the site was originally a graveyard for Great Plague victims, the last owners of the mansion were Hell’s Angels known as ‘The Nomads’, who used it as a clubhouse; until a party in 1993 where over two thousand bikers were locked inside and perished in a fire. The hill is also notably right next to a vile landfill site, filled with mad cows & alien torsos.\n\nWith himself as a bassist, 2D on keyboards and vocals & 2D’s girlfriend, Paula Cracker on guitar, all Murdoc needed was a drummer. A quick visit to Big Rick Black’s was all it took, asking Russel for an obscure record and dragging him out with a bag over his head when he wasn’t looking. Shockingly, Russel actually decided to stay with this maniac; convinced solely by the music they were developing. It seemed like Murdoc had finally achieved his goal and formed the dream band he always wanted…until Russel caught him having an affair with Paula in the Kong Studio toilets. Russel broke Murdoc’s nose five times and Paula was kicked out (debatably at the cost of her sanity).\n\nThe hunt for a new guitarist started immediately, with an advert placed in NME’s backpages; stating “Global phenomenon seek guitarist for World Domination”, “GSOH required” & “No hippies”. Shortly after the ad was put out, a ten-foot high FedEx crate was planted outside the door to Kong, with a little girl bursting out holding a Les Paul, screaming Japanese, shredding a killer solo, performing a twenty-foot high karate jump, bowing and saying one word, “Noodle”.\n\nDespite the language barrier and no memory of her past, Noodle fit in perfectly. The band immediately changed their name to “Gorillaz” and began recording; the first song to come from this fearsome foursome being Ghost Train. Murdoc sent the track with some publicity photos to EMI A&R man Whiffy Smiffy, encouraging him to see Gorillaz at the Camden Brownhouse. 2D had also invited Rachel Stevens to the gig, as the two seemed to get along well, eventually becoming a couple (again, don’t expect any happy ending with this, it’s 2D).\n\nOn the 5th of November, Gorillaz played their first gig at the Brownhouse, landing a contract with EMI seamlessly. The following day saw the record label signing party, where Gorillaz met an artist who’d go on to be a close friend of theirs (and a bitter rival to Murdoc) Damon Albarn. The party eventually devolved into a food fight, with Murdoc making advances towards Rachel until she stormed out, breaking up with 2D the next day (see?). After banking their seven-foot cheque, the band flooded Kong with all the right equipment to create their self-titled debut album.\n\nAfter the album’s release, their popularity was only getting larger and larger; but not all the attention they got was to their liking. A mysterious figure known only as “Dr Wurzel” had stolen Murdoc’s Winnebago, beginning an online craze where pictures of the RV in various bizarre locations would pop up online. Wurzel harassed Gorillaz constantly, driving Murdoc up the wall with this chase and bootlegging Ghost Train, with what was supposedly a photo of the pre-Noodle band lineup.\n\nAfter a lawsuit from a virtual band called Dopplegangerz, 2D leaning towards Buddhism & the Free Tibet Campaign to try and find his own identity and a wild Christmas party at Kong (with rivers of booze flowing down the corridors), Gorillaz had made a name for themselves in seemingly no time; starting off 2002 with their BRIT Awards performance and a North American tour. The tour started off rocky, only getting worse as it went on, as Murdoc was arrested the second they touched down due to an incident in Nebraska fifteen years ago. He barely reached the stage for their first gig after paying the $500,000 bail.\n\nNegative reviews of their Toronto gig didn’t help them either, nor did the nightmare trash heap on wheels known as their tour bus. Things seemed to get gradually better over the tour, but everything plummeted again once the band entered Mexico. On the 11th of March, Gorillaz did a performance that would debatably become their lowest moment on stage. Murdoc whacked a fan who jumped on stage with his bass. Russel collapsed mid-song and required vitamin injections to recover. Halfway through Man Research (Clapper), one of Siegfried & Roy’s tigers got drunk and tried to steal an audience member’s bike. Someone threw up their lung onto the stage. All of these problems would be floored by one final disaster…\n\nThe final nail in the coffin was when several audience members were crushed underneath a giant inflatable gorilla head from the stage set. The gig ended immediately and the kids trapped underneath the prop had to wait forty-eight hours before they could be freed. The group ended their touring here, moving to 125 Mulholland Drive so they could chill out and start laying out plans for a film. The band soon became mates with countless celebs in Hollywood (Murdoc managed to get himself thrown out of Hugh Hefner’s house by trying to smuggle out ashtrays). Bizarrely, Murdoc’s skin also permanently went from dirty yellow to dark green while tanning in LA.\n\nGorillaz began work on their movie Celebrity Harvest  (alternate titles included “Whoops! There Goes My Career!”, “Come Back With That Apple Pie” & “I Don’t Like The Smell Of That, Amigo”) in June, with Alfred C. Klinker as their director; not the wisest choice, as the film’s plot and tone seemed to drastically change during every day of filming. Gorillaz took a break from filming with an MTV performance in Portugal, where another bombshell occurred with a fan asking for an autograph; the item they wanted signed being a CD that the band didn’t recognise by a group now associated with them that they’d never even heard of.\n\nGorillaz flew back to LA, only to discover that the script for their movie had been rewritten yet again, finally firing Klinker. After Murdoc failed an audition for a TV series called Shoot to Kill (for being too old), the group decided to write the movie themselves, checking into Room 103 at The Sheraton and beginning their first idea pitching session amongst each-other. After a month of every idea going absolutely nowhere, 2D’s idiotic pitches eventually caused Murdoc to snap, going straight for his throat. Russel started yelling at Murdoc while Noodle began biting his hand; and 2D’s face was going as blue as his hair. In one swing, Russel almost knocked Murdoc unconscious. The green-skinned Satanist slowly got up, declaring his hatred for the group he’d formed and stormed out of the hotel, leaving the other three to themselves; ending Gorillaz then and there…\n\nTO BE CONTINUED\n\n(in Phase 2)\n\nShare this:\nTwitterFacebookPrint\nLoading..."
}