{
  "url": "https://gorillazforbeginners.com/phase-2/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2018/10/phase-2-logo.png?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2018/06/phase-2.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/10/phase-2-art.png",
    "https://gorillazforbeginners.files.wordpress.com/2019/06/search-for-a-star.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/habbo-hotel.gif",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/puppets.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/05/war-child-helmet.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/04/amnesty-international.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/icon-energy-drink.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/03/demon-lamp.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/05/demon-factory.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/the-chicken-choker1.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/shane-lynch1.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/dels-exorcism1.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/russels-recovery1.png?w=792",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/mr-kyuzo.png?w=251",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/reunited-at-kong.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/12/search-for-a-star-poster.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/pimp-my-rhino.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/jimmy-manson.jpg?w=367",
    "https://gorillazforbeginners.files.wordpress.com/2023/03/el-manana-poster.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/noodles-escape.png"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nPhase 2\nSLOWBOAT TO HADES\n2004-2008\n\nHistory | Tours | Lore\n\nFor many fans, nothing can compare to Phase 2 in terms of how much Gorillaz stepped up their game compared to the previous phase. The band had found their footing, proving that their image was now beyond a gimmick; something capable of richer subtext, a wider pool for collaboration and much more depth than anyone could’ve guessed at the time. Not only did the band reach their largest level of mainstream popularity, but they also released what many consider to be their magnum opus, Demon Days. They were back, they were badder than ever and they sure as hell weren’t willing to go down without a fight to the death.\n\nOn the 8th of December 2004, Gorillaz redesigned their website, expanding the virtual Kong Studios, enabling fans to now download low-quality unreleased song demos and access to a new music video, Rock It; which presented a brand new slogan “REJECT FALSE ICONS”. All of this came with the announcement of Demon Days, which was followed one week later with the world’s first global internet talent contest, Search for a Star, giving fans the chance to show the band their creative capabilities; the grand prize being the 3 winners (out of over 4000 contestants) making official content for the final Demon Days single in 2006 (El Mañana / Kids with Guns).\n\nIn early-2005, Feel Good Inc. was released online during a turning point in the Official Singles Chart, a merger that allowed download charts to constitute as sales; just so long as there was a physical release of the single as well. Gorillaz chose to bypass this via a loophole by releasing a 7″ picture vinyl that was limited to 300 copies before the official CD & DVD release date. This tactic made Gorillaz the first band in history to chart solely from downloads, a feat that only saw their fame grow even higher when Apple began to feature Feel Good Inc. in their iPod adverts.\n\nThe release of Demon Days was met with immense praise as it became Gorillaz’ first #1 album in the UK charts; with their newfound success enabling them to branch out through merchandise, including playing cards, a Vestax record player (with an exclusive slipmat), mobile phone charms, a Rubik’s Cube, a 5boroNYC skateboard & countless other items. The most standout range of products to possibly stem from Gorillaz’ entire career were during this period as well, multiple sets of Kidrobot figures; with a Chrome line planned for SDCC that was never released.\n\nThe group were able to lift themselves even higher with a takeover on BBC Radio 6 Music’s 6 Mix show; followed shortly by the release of their second single, DARE, which hit #1 on the UK charts. Around this time, the band launched their own fashion label, G Foot. Gorillaz also branched out into gaming with a guest appearance performing in Habbo Hotel; along with their own range of phone games known as Gorillaz Entertainment System.\n\nTo boost the frequency of their appearances, and to make their presence more public, puppets of Murdoc & 2D were made (courtesy of Jim Henson’s Creature Shop) for various occasions that involved the band, such as interviews, acceptance speeches & even riffing their own live concerts. The group would perform their first (of only two) hologram performances in Lisbon at the EMA’s near the end of 2005, wrapping up the year with 3 Mobile broadcasting Gorillaz’ version of the Queen’s Speech on Christmas Day & a Gorillaz episode of MTV Cribs airing the following day. The rate of new content paired with the scale of their range in media appearances made them seem unstoppable.\n\nCharging furiously into 2006, another turning point in mass-media would change Gorillaz’ approach to music distribution forever, minimalizing their TV appearances & physical releases in favour of the rising range in online outlets during the latter half of the decade (iTunes, YouTube, Twitter, Spotify, Facebook, SoundCloud, etc.). However, they still managed to continue breaking new grounds outside their newfound online playground with another hologram performance at the Grammys, this time with Madonna; followed shortly with a BRIT Awards performance of Dirty Harry. The band also helped to promote a range of Prps jeans, provided artwork for Amnesty International’s exhibition, Protect the Human & designed a helmet for a War Child charity auction to promote the film, Jarhead. There was even a Gorillaz exhibition at the Design Museum when Jamie Hewlett was nominated for the Designer of the Year Award (which he won).\n\nNear the end of the year, Gorillaz began to slow down the rate of their content, but each major release would have monumental significance. Firstly, there was the band’s first autobiography, covering their fictional (and real-life) history through the perspective of the characters, Rise of the Ogre. Late-2007 would see the release of their second compilation album, D-Sides, which collected various tracks from Phase 2 in a similar fashion to G Sides. Oddly, there was even a Gorillaz energy drink that was exclusively for subscribers to the magazine, Icon.\n\nThe next release of Phase 2 however was a more ambitious addition to the Gorillaz catalogue, as Bananaz was a 2008 documentary by Ceri Levy that followed Damon & Jamie from 2000 to 2006; displaying highlights from over 300 hours of footage taken during the two phases. The movie was shown at various film festivals, made available online via Babelgum & released on DVD in 2009.\n\nNear the end of 2009 (at the dawn of Phase 3), the band released a home decoration modelled after some demon characters in Phase 2 artwork and titled Demon Lamp, which was released in two colours, the “Flagship” Red Demon & the “Special Limited Edition” White Demon in 2013; as well as a limited range of four glow-in-the-dark T-shirts.\n\nPhase 2 marked Gorillaz’ highest point in fame, receiving more attention in mainstream media than any phase before or since. The level of effort put into this period paid off when the group won a Grammy for “Best Pop Collaboration with Vocals” (Feel Good Inc.), an EMA for “Best Group”, two VMA’s for “Best Special Effects” & “Breakthrough Video” (Feel Good Inc.), an NME “John Peel Award for Innovation” (DARE), two Q Awards for “Best Video” (Feel Good Inc.) & “Best Producer” (with Danger Mouse), two DMA’s for “Artist of the Year” & “Best Dance Artist”, a Webby Award for “Artist of the Year” & a Jim Henson Creativity Honor.\n\nTOURS\n\nPhase 2 gave us three unique live legs:\n\nThe first, Demon Detour, had Gorillaz providing live recordings to radio stations across the US so “mini-concerts” could be held across the states.\nSecondly, they were commissioned to perform Demon Days Live at the Manchester Opera House to generate hype for the Manchester International Festival. The tickets for all five nights sold out in just one hour.\nFinally, five Demon Days Live NYC gigs were performed at the Apollo Theater, with an unforgettable Motorola advert at the start of each gig helping to fund those concerts. Infamously, the first night of this event was faced with a technical failure, resulting in a show without any visuals.\n\nThe live band:\n\nKeyboards: Mike Smith\nLead guitar: Simon Tong\nBass guitar: Morgan Nicholls\nRhythm guitar: Simon Jones\nPercussion: Karl Vanden-Bossche\nDrums: Cass Browne\nTurntables: Darren Galea\nStrings: Demon Strings\nBacking vocals: Aaron Sokell, Roses Gabor, Sharlene Hector, Wayne Hernandez & Wendi Rose\nLORE\n\nWith Murdoc leaving his comrades, fed up with them and doubtful that he could go any further with them, he headed back into Mexico; discovering a brothel called The Chicken Choker. It didn’t take long for him to get in trouble, trying to pay the girls in autographed dud cheques & notes with his face printed on them. His thirty-year sentence behind bars at La Mesa State started on Halloween. During this time, Murdoc became friends with Pedro “Ears” Lapetzo & Carlos “Three-faced” Benito, who taught him a little black magic; Murdoc also met a raven named Cortez who quickly became his faithful pet/friend (until the day he tried to cook a roast dinner on Absinthe Night).\n\nMurdoc used his time wisely, passing a medical exam and becoming a GP. Eventually, in February 2004, Dr Murdoc Niccals M.D. decided to break out of prison, which he managed flawlessly; motivated by the urge to make a new album. After making a quick stop at The Chicken Choker to commit the exact same crime (escaping the police this time), he got on a plane back to England; taking his three new friends & a bottle of tequila with him.\n\n2D stayed in LA, making friends with Brian Setzer and joining the Viper Room Club; through Brian, he met Britt Ekland, eventually living in her flat for a couple months. In November, 2D decided that he’d had enough with Britt banging on the walls and building a wicker statue, so he flew back to his dad’s home in the UK. Immediately, he was given a new job at his dad’s workplace, Tusspot’s Fairground; collecting money on the Switchback Ride. He also became best mates with Shane Lynch during this period, developing a fascination with Monster Trucks and gaining a new upbeat outlook on life. After regaining his ego, he realised that it was his vocals & looks that made Gorillaz a success; giving him a new sense of awareness when it came to the band.\n\nRussel stayed behind in LA, wandering the streets by himself whist feeling hollow and shaken, unsure why. Eventually, he went to take a picture with a fan, only to see the Grim Reaper in the polaroid. In one of the most traumatising experiences of Russel’s life, he started to see the spirit of his friend Del leave his body, saying his final goodbye as the Reaper took him away. After spending hours staring at the mark Del’s ghost had left on the pavement, Russel passed out; only to be woken up by Ike Turner, who pulled him off the floor and invited Russ to stay in his house for a while.\n\nMoving into Ike’s basement, Russel tried to work on some new music with him; using some old instruments and an eight-track machine. However, every attempt went sour, with Russel’s sanity beginning to slip throughout between these sessions. He began seeing things and hearing countless instruments being played in his head, trying to record these visions. Eventually, he buried the tapes, believing that they were somehow causing countless world problems. Once he’d found himself again, he headed back to the UK, still hearing the demos as if they were calling out from their burial ground for him.\n\nAs for Noodle, questions started to knock back and forth in her head; with images of army bases & orders invading her dreams. She eventually saw a vision of Japan, believing that Gorillaz now felt more like a prison than a pastime. Upon Murdoc’s departure, she flew to Osaka, demanding answers. After searching Japan for nearly a year, Noodle was close to giving up; going to an open restaurant in Tokyo for some steamed fish, where she accidentally knocked over a tray of ocean bacon, two words that managed to completely blow her mind.\n\nIn the 1990’s, the Japanese government were working on a top secret super solider project, where 23 children were enlisted to be trained in military warfare, knowing every possible language and giving each child a specialist skill (Noodle’s was music, with her specialty being the guitar). Code words were used to wipe the children’s minds, reinstall their memories and trigger them to use their skills, becoming the walking equivalent of an atom bomb when in action; “Ocean Bacon” was the trigger phrase for returning their memories. Eventually, this project was deemed too dangerous; meaning that all the evidence had to be removed, including the kids. The trainer for the kids (and Noodle’s guardian from birth), Mr. Kyuzo, was hesitant to kill Noodle; noticing an advert in the back of NME for a “wanted guitarist”, wiping all of Noodle’s memories aside from her musical skills and sending her to Kong Studios in a FedEx crate, the rest was history and everything finally came full circle. Noodle finally knew who she was.\n\nMr. Kyuzo then ran out of the restaurant kitchen, working as a chef there and immediately saw Noodle; explaining everything to her and saying goodbye again as she flew back to Kong in October 2003, satisfied with her revelation. This would only be the beginning of her new life, as she couldn’t help but notice how ravaged Kong had become in the year-and-a-half since any of the band had been there. The building wasn’t just abandoned and desolate, it was also infested with the undead! It took six months to clear the building, with Noodle bunkering herself up in the TV room for safety; her newfound understanding of English allowed her to soak in everything on the TV’s, only to discover that society was giving people nothing other than shit.\n\nFearful that the general public were the real zombies in the grand scheme, Noodle started to write a new album; eventually forming the band’s next major release, Demon Days. After sending texts to her three former bandmates, the trio all arrived by themselves on the 3rd of March 2004; ready to record their parts for the album, as it had already been written in its entirety. Along with the help of Damon Albarn & their new producer, Danger Mouse, the group managed to find several artists to work with on the record, something that would become a trademark for their biggest albums.\n\nKong Studios was reopened in December, with several extensions made to the building courtesy of Zombie Flesh Eaters. These renovations uncovered an underground bunker that contained a gateway to hell; and a disused subterranean hideout was discovered when Danger Mouse accidentally crashed Murdoc’s new Winnebago into a wall in the carpark. Noodle then started the Search for a Star contest to encourage creativity amongst the Gorillaz fanbase, as well as hosting an online community chat session called Noodleblast; as the band prepared for the release of their most iconic single…\n\nThe release of Feel Good Inc. was the band’s most explosive move to date, thriving in the charts and pushing themselves up even further with Demon Days shortly afterwards. The next logical stop after a few video shoots was to go on tour, keeping their gigs exclusively at radio stations in America to avoid the complexities of booking venues & organising stages. The tour started on the 6th of June at 6pm (6/6/6, at Murdoc’s request for his birthday); things slowly started to go south as the group were making long-distance tourbus journeys to make shows in different parts of the states every day. Russel managed to find a pastime to keep his mind stable during all this, taxidermy.\n\nThings when from absurd to insane when the band suddenly found themselves under attack from unknown snipers on the road. The list of candidates for the identity of the shooter seemed endless, making it almost impossible to have them arrested (suspects included Paula Cracker, Noodle’s Japanese government bosses, Murdoc’s dad & Alfred C. Klinker). Eventually, the chases got far too chaotic, between doing gigs on a near-daily basis, hurtling through deserts at 200 mph & losing all sleep from the gunfire, Murdoc eventually decided to take matters into his own hands, asking their tour A&R man, Jimmy Manson to sort it all out; the tour was shockingly brought back to a calm pace as the assaults stopped almost immediately after this.\n\nAfter another chaotic video shoot, Gorillaz returned to the UK; tired and double-booked. They were set to perform at the VMA’s in Lisbon, while simultaneously set to appear at the Manchester Opera House in late-2005. To fix this dilemma, the band decided to get Damon & a live band to perform for them instead; the live ensemble would return in 2006 for a series of gigs at the Apollo Theater.\n\nAfter both performances, MTV visited Kong Studios to film an episode of MTV Cribs. Followed by a Queen’s Speech video from Murdoc for 3 Mobile. 2006 saw Gorillaz flying to LA for the Grammys, visiting a party at Dennis Hopper’s the night before and opening the ceremony with Madonna & De La Soul. Things ended on a slightly sour note however, as Murdoc ended up in an argument with Jughead Jones during the afterparty, who drunkenly called Gorillaz a ripoff of his band. Gorillaz flew home for a BRIT Awards performance, and the plans for their final Demon Days music video were about to begin…\n\n“Fuck Jughead.” – Murdoc Niccals, 2006\n\nJimmy Manson had gone from being Gorillaz’ A&R man during the Demon Detour to the head of their record label in the US, but with the help of his cellmates from Mexico, Murdoc discovered Manson’s true intent. It became apparent to him that Manson was arrested in the same cell as Ears Lapetzo & Three-faced Benito back in 1999, discussing his plans to murder several bands once he was out; as he’d originally auditioned to be Gorillaz’ guitarist until Noodle was picked. Manson later got to meet the group in 2002 during their time in LA, eventually becoming chummy with Murdoc during the Demon Detour. But it turned out that Manson was the one responsible for the murder attempts during their last tour; answering how the gunners were able to stop so quickly after he was asked to prevent any further chases. He was trying to kill Gorillaz the entire time!\n\nManson’s train of thought was that murdering the band at their peak would lead to more album sales, allowing him to rake in the profit. Murdoc took advantage of knowing this to devise his own plan to “help” Manson, offering that they could kill the rest of the band during a music video shoot, staging it to look like an accident and starting a new band with him & Manson together as members; it was too tempting for Manson to refuse. This led to the El Mañana video entering production, insisting that Noodle would have a parachute and the helicopters would be loaded with fake bullets.\n\nWhile the rest of the band were unsure where Murdoc was going with the video, they all complied with him and set up the floating island regardless. The 7th of March 2006 would be one of the most eventful days in the band’s history, as the video shoot took place; this was a video that could only be accomplished in one take, and Murdoc’s plan had to succeed. Murdoc had secretly told Jimmy to hide in the lighthouse on the island, shooting Noodle amidst the gunfire and escaping through the smoke. However, Murdoc double-crossed Manson, locking him in his hiding space without any guns and keeping him inside the island as it crashed into chasm, killing him; while Noodle parachuted to safety.\n\nThings went from visually stunning to devastating when nobody could find Noodle after the shoot was over, with Murdoc acting as if nothing had gone wrong and insisting that the video should still be edited and released accordingly. After the Apollo gigs, Kong Studios had mysteriously begun to disintegrate, as if Noodle’s absence was slowly destroying the building. Noodle had said prior to the video shoot that she wanted some time away from the publicity, using the shoot as an opportunity to go into hiding. Shortly after this, 2D & Russel left Kong to go their separate ways; with Murdoc eventually doing the same, abandoning the building once again. But later that year, on the 26th of October, the radio set in Kong’s basement began transmitting a distorted distress signal from none other than Noodle, calling for her bandmates and demanding help…\n\nTO BE CONTINUED\n\n(in Phase 3)\n\nShare this:\nTwitterFacebookPrint\nLoading..."
}