{
  "url": "https://gorillazforbeginners.com/phase-7/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2022/07/phase-7.jpg?w=541",
    "https://gorillazforbeginners.files.wordpress.com/2022/06/the-last-cult.png?w=278",
    "https://gorillazforbeginners.files.wordpress.com/2022/10/bose.jpg?w=637",
    "https://gorillazforbeginners.files.wordpress.com/2022/10/smirnoff.jpg?w=190",
    "https://gorillazforbeginners.files.wordpress.com/2022/11/fifa.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2022/12/discord.jpg?w=1019",
    "https://gorillazforbeginners.files.wordpress.com/2023/02/gorillaz-in-conversation.png",
    "https://gorillazforbeginners.files.wordpress.com/2023/06/the-getaway-shows-1.jpg?w=576",
    "https://gorillazforbeginners.files.wordpress.com/2023/03/mopiary-pruning-your-aura.png?w=819",
    "https://gorillazforbeginners.files.wordpress.com/2022/08/the-last-cults-meeting.jpg?w=819",
    "https://gorillazforbeginners.files.wordpress.com/2022/09/painting-the-obelisk.png?w=821",
    "https://gorillazforbeginners.files.wordpress.com/2022/11/the-forever-cult.jpg?w=819",
    "https://gorillazforbeginners.files.wordpress.com/2023/04/brewing-essence-of-murdoc.jpg?w=819",
    "https://gorillazforbeginners.files.wordpress.com/2023/01/lady-hollodown.png?w=685",
    "https://gorillazforbeginners.files.wordpress.com/2023/01/2ds-aura-exam.jpg?w=720",
    "https://gorillazforbeginners.files.wordpress.com/2023/03/murdocs-date.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2023/04/noodle-at-the-detonator.png?w=821",
    "https://gorillazforbeginners.files.wordpress.com/2023/04/russel-unplugs.png?w=819",
    "https://gorillazforbeginners.files.wordpress.com/2023/04/2d-forgives.png?w=720",
    "https://gorillazforbeginners.files.wordpress.com/2023/06/passports.jpeg?w=1024"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nPhase 7\nCRACKER ISLAND\n2022-Present\n\nHistory | Tours | Lore\n\nAs Gorillaz returned to making concept albums, they decided to take their next record in a more daring direction with cult-themed marketing; this began with a newsletter for the cartoon band’s new religion, “The Last Cult”.\n\nGorillaz instantly hit the ground running by kicking off this next phase with a world tour; early concerts saw the band performing new songs (Cracker Island & Silent Running). Their marketing also brought us a new set of slogans, including:\n\nCull-Ture\nI am the Lamb\nNo More Zeitgeist Anymore\nThe Static Channel\nTurn off Tune out Drop in\n\nAs the phase began to unfold, the single Cracker Island was released; followed by a series of Twitter Spaces Q&A’s hosted by Murdoc, a podcast hosted by 2D titled The Stuart Potcast, a website that allowed fans to put themselves in Cracker Island posters & a pop-up store in Australia. Merchandise from this period includes T-shirts & lobby cards; Gorillaz’ live bassist, Seye Adelekan also teamed up with Baum Guitars to release replicas of his bass, Pink Thunder.\n\nOn the 31st of August, the album, Cracker Island was announced; alongside the single, New Gold. Later that year, a Guild S200 T-Bird guitar the band designed for Robert Smith sold at an EarthPercent charity auction. Gorillaz later teamed up with Bose to offer exclusive sets of QuietComfort Earbuds II through a series of sweepstakes (limited to 100 pairs per character), they then released limited edition bottles of Smirnoff No. 21; and created a set of cocktail recipes as part of the collaboration.\n\nGorillaz continued to widen their publicity by making their mark in the game, FIFA 23 with in-game kits featuring their imagery; as well as a new song for the game’s soundtrack (their next single, Baby Queen). The band’s tie-in with the World Cup continued with Penalty Shootout Game, which gave fans the chance to win a Gorillaz-themed goalkeeper kit. Afterwards, they released a range of Christmas merchandise; and held a Smirnoff-sponsored livestream Q&A titled Mixology Masterclass.\n\nWith the release of their fourth single that year (Skinny Ape), Gorillaz teamed up with Nexus Productions to create the app, Gorillaz Presents; which was used for two AR live performances of Skinny Ape, taking place in Times Square & Piccadilly Circus. The band went on to branch out their social media presence even further by launching their own Discord server; along with a Snapchat AR try-on feature to showcase their sweaters.\n\nGorillaz rang in 2023 with their next single (Silent Running), followed by two live interview/album showcase/audience Q&A’s between Damon Albarn, Jamie Hewlett & Alan Carr; which were organised by Banquet Records and both took place the day before Cracker Island’s release. The album’s launch was followed with two more pop-up stores, one in France & another in Australia. Around this time, BBC Sounds released a batch of Gorillaz-focused episodes of their Artist Icons series; and the game, Synth Riders added a “Gorillaz Music Pack” DLC expansion which added several of the band’s songs to the title’s ever-growing song list.\n\nCracker Island was an instant success for the band, as it became their second #1 album in the UK charts (the first being Demon Days); its release was shortly followed by a “Deluxe” edition, a live Q&A with Murdoc, an album commentary provided by Damon Albarn on Amazon Music’s Alternative Hits radio station & an MTV broadcast of a concert they performed for the 2022 EMA’s. So far, Gorillaz have won an EMA for “Best Alternative”, a Webby Award for “People’s Voice Winner – Metaverse, Immersive & Virtual, Best Performance” (Skinny Ape (Immersive Live Performance in Times Square)) & a Cannes Lion Award for “Digital Craft Lions: Metaverse, New Realities & Emerging Tech” (Gorillaz Presents).\n\nTOURS\n\nSupporting acts: Nathy Peluso / Zeballos / Valesuchi / Toy Selectah / LosPetitFellas / Moonchild Sanelly / Fatoumata Diawara / Lous and the Yakuza / Mr Jukes / Barney Artist / Deki Alem / EARTHGANG / Jungle\n\nLike Phase 5, this era of touring began with a countless amount of festival gigs, before ending 2022 on a North America tour; the final show ending with an afterparty. Noteworthy performances from that year included several songs from Cracker Island, the first live performances of New Genious (Brother), Rockit, Little Pink Plastic Bags & most shockingly, Damon Albarn’s solo single, The Tower of Montevideo.\n\nIn 2023, a 4-gig tour across North America titled The Getaway Shows was announced; but cancelled shortly afterwards for unknown reasons.\n\nThe live band:\n\nKeyboards: Jesse Hackett & Mike Smith\nLead guitar: Jeff Wootton\nBass guitar: Seye Adelekan\nDrums/percussion: Femi Koleoso & Karl Vanden-Bossche\nBacking vocals: Adeleye Omotayo, Angel Silvera, Matthew Allen, Matt Maijah, Michelle Ndegwa, Petra Luke & Rebecca Freckleton\nLORE\n\nAfter the emotional rollercoaster of a pandemic-driven lockdown (immediately followed by the world’s craziest road trip), a sinkhole opened up underneath Kong Studios; forcing the band to relocate to a house above Silver Lake. They arrived on what they called “the eve of the pink dawn” and set up a studio in the basement to record their next album, but Murdoc claimed to witness a prophecy; one which insisted that he should be the leader of his own cult. After convincing his bandmates that this cult would aim to improve the world, they agreed to join him and “The Last Cult” was born.\n\nAs they had no sacred temple, the “High Elders” held their first meeting at a nearby diner; in which they agreed to divide their work. Murdoc became “The Great Leader” (being put in charge of public statements), Russel became “Truth Seeker” (researcher), Noodle became “The Scholar” (doctrine writer) & 2D became “The Chosen One” (janitor). With their roles assigned, the High Elders went to work and began sending sermons to their followers; encouraging them to spread the word of The Last Cult in whatever ways they could think of.\n\nAiming to impress the neighbours, Murdoc bought an obelisk from Etsy to display outside their HQ; but the neighbours didn’t seem to care, so 2D was tasked with painting it pink in the hopes that they would. Meanwhile, Russel appreciated the boost their newly bought spire provided to his TV reception; as he was busy trying to find the keys to “the promised land” buried within the TV static. Noodle however began to feel unsure about all of this.\n\nOne evening, 2D visited the neighbours for a cup of tea; and it turned out that they had their own cult as well! 2D kept scrolls under his bed detailing this organisation, the papers revealing to Noodle that they were known as “The Forever Cult”. Murdoc grew jealous, as the Forever Cult’s high priestess “Moon Flower” seemed to show more interest in 2D than in him; while Russel dug deeper into his notes from watching “The Static Channel” and began prophesizing an event he called “The Rupture”, which he believed would result in a gateway to “the promised land” opening in the Hollywood sign on New Year’s Eve.\n\nMurdoc soon decided to begin commercialising his status by selling his bathwater to the masses for Christmas (which he dubbed “Essence of Murdoc”); Noodle tried to stop him from marketing this unholy cocktail of herbs, vegetables, wine & cheeses by spiking it with chili powder, but the product was quickly recalled after reported cases of skin shedding from perfume testers. Meanwhile, 2D began sharing pamphlets from next door offering a free “Aura exam”; and as the year was coming to an end, Russel began preparing for the group’s passage through the Rupture.\n\nAs the new year rang in, Russel found out the hard way that his Rupture prediction was wrong; Murdoc also began to see his plans go sour, namely his decision to make 2D “The Chosen One”, as he migrated to the Forever Cult. Meanwhile, Noodle’s research from reading 2D’s Aura exam papers led her to an actress called Lady Hollodown, who had been a popular name in the early years of Hollywood (and also eerily resembled Moon Flower); she’d notably bought land in 1923 and was an early investor in “Hollywoodland”. Further digging revealed that Hollodown’s movie, The Hills Are Hungry was made by a film studio she’d set up titled Forever and Ever Pictures, which was originally based in the exact same location that the Forever Cult were located! Noodle went next door for answers, only to find a sheet of paper alluding to a “rupture”. Russel realised that his calculations had been off, figuring out that the Forever Cult were immortals who made a deal with a demon to keep their youth by performing a sacrifice every 25 years. As he, Noodle & Murdoc rushed to find the Forever Cult, 2D was with them; finishing his “Lovely Smoothie Drink” and being prepared for his Aura exam.\n\nNot far from the Hollywood sign, the Forever Cult tied 2D to a wheel and began lower him down a well into an underground dungeon; fully intent on sacrificing him to the demon itself! As his bandmates snuck in to try and save 2D, they were soon caught and a fight ensued; which led to a bottle of Essence of Murdoc falling from his robes into the well, causing the creature to explode. The Forever Cult’s members instantly crumbled to dust, except for Lady Hollodown; who collapsed as the police arrived to assess the situation. 2D, Noodle & Russel were brought in for questioning (Murdoc had run off before cops showed up, as usual); but Noodle used the band’s phone call to bring Murdoc over so he could bail them out.\n\nHollodown had been seemingly granted a final few days and sent Murdoc an email explaining how the Forever Cult formed before accepting his offer to a date at the drive-in; now physically at her rightful age of 123. As the couple watched The Hills Are Hungry, she finally turned to dust herself, with Murdoc putting her remains in an urn to keep hold of; giving himself a “Hollywood ending” by managing to finally get the girl.\n\nMeanwhile, Noodle stood above the Hollywood sign and watched as the pink dawn finally rose above LA; to her, this sign was an altar for the biggest cult known to man, which she was prepared to destroy via a cinematic-style explosion to end the cult of Hollywoodland once and for all. However, before setting off the detonator, she changed her mind and considered that there may be a better way to fix the world somewhere out there.\n\nAfter months of trying to find meaning in the Static Channel, Russel finally decided that it was no use and headed off-grid to the California desert; where he took some time to isolate without any TV’s or phones, just sun, sand, sodas & sweet, sweet silence. Getting away from the rush of modern society helped him to unwind and realise that there was still good in this world after all.\n\n2D felt sorry for the demon his band had killed; and decided to give its disembodied head a visit to let it know that he had no hard feelings. He pulled out a melodica and played a song to the head to make amends, as he always turned to music whenever he needed cheering up; hoping the same would be the case for the demon. He then promised he’d visit the demon if he was ever in the area again.\n\nWith the Last Cult officially disbanded, the LAPD issued a search warrant for the band’s mansion HQ; leading to the group escaping to New York where an old friend of Murdoc handed them fake passports in order to hide away in Mumbai…\n\nTO BE CONTINUED\nShare this:\nTwitterFacebookPrint\nLoading...\nFollow\n "
}