{
  "url": "https://gorillazforbeginners.com/phase-5/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2018/10/phase-5-logo.png?w=800",
    "https://gorillazforbeginners.files.wordpress.com/2020/08/phase-5-1.jpg?w=736",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/tranz-video.jpg?w=736",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/freemurdoc-phone.gif",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/freemurdoc-updated.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/03/free-murdoc-alexa-skill.png",
    "https://gorillazforbeginners.files.wordpress.com/2019/05/kroq.png?w=219",
    "https://gorillazforbeginners.files.wordpress.com/2019/03/levis-patches-1.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/11/2ds-new-ego.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/murdocs-march-to-freedom.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/big-balls-mcguinness.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/vlad-the-inhaler.png?w=271",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/map-to-mierda.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/murdocs-release.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/10/murdocs-saviour.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/02/brits-2019.png?w=1024"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nPhase 5\nTHE NOW NOW\n2018-2019\n\nHistory | Tours | Lore\n\nUsually, Gorillaz would take time between each phase to develop new art, lore and music, but traces of Phase 5 had popped up as early as mid-2017; such as new art from Jamie Hewlett & new songs being performed by Damon Albarn during the Humanz Tour (Idaho & Hollywood), as the album was written during the US leg. On the 31st of May 2018, The Now Now was announced with its two lead singles. Marketing from the start of this phase harkened back to their early years, as Gorillaz utilised a range of new slogans to promote themselves, including:\n\nAlgorithm Is a Dancer\nArt Disease\nBig Brother Is Watching YouTube\nEat Sleep Tweet Repeat\nG Is the Magic Number\nIntelligence Is Artificial\nNo More Unicorns Anymore\nPopaganda\nSave us from Him\nStranger Together\nStream if You Wanna Go Faster\nYou Gotta Have Fate\nYouth Against Infants\n\nEarly on, a “Free Murdoc” campaign was started, allowing fans to support the band’s cartoon bassist in his plan to escape prison via purchasing a “Campaign Pack” (a cap, shirt, pin badge, patches, bumper stickers & a personalised hand-written letter from Murdoc), listening to various answering machine calls from him online & participating in social network events where Amazon Echo owners could call Murdoc; as well as following an ongoing story through text conversations.\n\nMeanwhile, the band would continue to promote their album in the same ways Humanz had been marketed; including interviews with journal websites, mixes, playlists & a Q&A with the public on YouTube Community. There were additionally contests to win concert tickets through a KROQ sweepstake & a scavenger hunt at Keystone Comic Con.\n\nAlong with the publicity came new merchandise, most notably a collection of G-Shocks & a customisable range of Levi’s clothing. G Foot would also continue into Season 2 with new shirts, boxers & beach towels; alongside a tie-in with GEYM. There were additional plans to create an AR mobile game with Jaguar titled Demon Chaser, which would see players customising and racing I-PACE SUV’s; with a contest allowing a handful of finalists to compete on-stage at Demon Dayz Festival LA in late-2018.\n\nIn late-2019 (the start of Phase 6), a documentary by Denholm Hewlett titled Reject False Icons was released, following the band’s career from 2016 to 2018. Shortly after the film’s one-night theatrical run, an extended “Director’s Cut” was uploaded to YouTube on Christmas Eve.\n\nDespite being one of their shortest phases, Gorillaz used this time wisely and ended up winning a Drum Award for “Best Use of a Chat Bot”, an MPG Award for “Producer of the Year” (James Ford) & a Webby Award for “Games & Entertainment – Apps, Mobile and Voice” (#FreeMurdoc chatbot).\n\nTOURS\n\nSupporting acts: The Internet / Little Dragon / Jupiter & Okwess\n\nGorillaz began touring this phase with several guest appearances at festivals over the summer, performing songs off The Now Now; with a small detour in Japan to showcase the album in its entirety. The final stretch known as The Now Now Tour spanned North America and was marketed as the “last chance to see Gorillaz live”; during this leg, several of their lesser-known songs were notably played, including Lil’ Dub Chefin’, Shy-town & even a cover of Blur’s hit single, Song 2.\n\nThe live band:\n\nKeyboards: Jesse Hackett & Mike Smith\nLead guitar: Jeff Wootton\nBass guitar: Seye Adelekan\nDrums/percussion: Gabriel Wallace & Karl Vanden-Bossche\nBacking vocals: Adeleye Omotayo, Angel Silvera, Matthew Allen, Michelle Ndegwa, Petra Luke & Rebecca Freckleton\nLORE\n\nWith Murdoc out of the picture, 2D saw this as an opportunity to finally take the spotlight, developing a new ego that made him considerably more arrogant than he’d been in the past. The band had acquired a new bassist for gigs, a personal mate of Murdoc’s; Ace from The Powerpuff Girls (yes, seriously). 2D however, took full advantage of manning the driver’s seat; and with his crew, Gorillaz made The Now Now (something Murdoc wasn’t too happy about).\n\nMeanwhile, in HM Prison Wormwood Scrubs, Murdoc had begun plotting his escape. Through the support of his campaign followers, he began to search for dirt on El Mierda by climbing the ladder of inmate respect; from beating up the largest guy he could find, Big Balls McGuinness. According to Murdoc, the fight ended in his favour; with him securing the win with a Spinning Bird Kick.\n\nIn reality, he went down in one sucker punch; still earning the respect of his peers, despite learning little to nothing about El Mierda. However, he found out that one of Mierda’s associates was in Scrubs with him and began to seek info on the suspect, Vlad the Inhaler. Vlad had a tattoo of Mierda’s hideout on the back of his head, so Murdoc asked his loyal supporters to pose as Vlad’s fiancée, Millie. This was to get a picture of said tattoo, revealing to Murdoc his adversary’s whereabouts, Patagonia.\n\nMeanwhile, Noodle had begun to notice that 2D’s change in attitude seemed rather suspicious; believing that El Mierda had possibly possessed him, based on the line “Mierda – soul harvester” crossed out on Murdoc’s plan. With a chance of Murdoc knowing something about Mierda that could’ve been effecting the band, Noodle volunteered to help her former bandmate out by heading to Patagonia to hunt down Mierda; for the sake of their frontman.\n\nIn the middle of August 2018, Noodle had arrived in Patagonia with all the gear she needed to help her through the trek; her samurai sword, Hello Kitty mittens & a photo of Katsu for warmth. Along the way, she met a gang of andean cats who began leading her to Mierda’s hideout.\n\nBack in prison, Murdoc was fed up with waiting; growing more and more impatient with Noodle and opting to escape via sewer pipe. #FreeMurdoc was going nowhere and Murdoc wanted out more than ever, wading through shit until he reached a locked gate. With the help of his fans (via sharing a PDF on a lent phone from a warden), the green-skinned sewer-dwelling party animal opened the gate; only for the liquid to suddenly start rising. To Murdoc’s horror, there was another wall in his way; leaving the poor sod to drown in faeces.\n\nMeanwhile, with the help of her new feline friend, Fuku, Noodle reached Mierda’s hideout; dumbfounded when the coordinates led her to a health spa, the El Montaña Wellness Centre. This was run by El Mierda, who was actually a million year-old man who had retired from crime years ago. Confused, Noodle phoned Scrubs to ask about Murdoc; discovering that not only had Murdoc been released on the day of his shitty escape (if you’ll pardon the pun), but his arrest was actually due to unpaid parking fines. The guy at the Strobelite shoot was a leather salesman named Juan and the El Mierda/smuggling story was fabricated entirely by Murdoc for a publicity stunt!\n\nOn the brink of death, Murdoc saw a mysterious image (later recreating what he saw with the sketch provided). This was followed by blacking out and waking up in an ALDI car park, covered head-to-toe in crap. To him, this seemed like a sign, an opportunity to become a new man and absolve himself by making things right; starting with the woman he believed he’d sent to an unnecessary death, Noodle! After taking a shower, Murdoc flew to Argentina and bought a demonic yak who was once a human; transformed by Mierda (Murdoc named her Madonna). After being tied to Madge by the warlock he bought her from (along with a letter pleading for Noodle’s safety, in case he died along the way), Murdoc’s new journey to find Noodle had begun.\n\nOver the course of a few days, Noodle talked with Mierda about how he used to use his powers for evil, but now only used them for spiritual healing; meaning 2D’s change in attitude was simply because of his ego. Shortly after this, Noodle was shocked to see a yak approaching her in the snow, it was Madge with the middle-aged hell raiser himself! Murdoc was thrown into a hot spring to thaw out, with the pair spending a few days at the spa before flying back home. Once they returned (bringing Madge with them as a new pet for 2D), Murdoc began a manifesto of ways he’d improve his life; while Gorillaz began preparing for the final leg of their tour, with Murdoc back in the band and Ace returning home to write his memoirs.\n\nPrior to the Patagonia trip, Noodle met Mr. Ibe, the creator of G-Shock. With the pair sharing an interest in intergalactic dreams, Mission M101 went underway. The plan was to send Gorillaz into space, making them the first band to perform a gig out there. After Murdoc returned, the time had come and they soon reached Galaxy M101, greeting an alien nightclub with their watches; one of which was accidentally swallowed by the blue-skinned, three-eyed, aptly named crime lord, Don Alien. A subsequent chase back to Earth ended with a crash-landing in Carnaby Street’s G-Shock store, coincidentally proving that the Gorillaz line of watches passed the durability test; meaning that they were ready to be released! Meanwhile, Don Alien soon noticed a video of himself choking on the watch he ate via Murdoc’s Twitter, planning his revenge…\n\nAs a reward for their efforts, Mr Ibe gifted Gorillaz with a set of G-Shocks, which were timed to alert them when he needed their help again. When the time came, he showed off new designs based on their albums, only for Don Alien to burst into his HQ; packing heat. The Don was quickly won over by the new watches and ceased fire, befriending the band in the process (YES, SERIOUSLY). Shortly after this, the group separated to go travelling; taking in the world around them and drawing influence to begin preparing “the machine”…\n\nTO BE CONTINUED\n\n(in Phase 6)\n\nShare this:\nTwitterFacebookPrint\nLoading..."
}