{
  "url": "https://gorillazforbeginners.com/phase-4/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2018/10/phase-4-logo.png?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2019/08/phase-4.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/09/sonos.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/06/gorillaz-app-e1528291843411.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/06/the-lenz.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/06/red-bull1.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/11/g-foot-season-1.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/10/all-on-the-board.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/10/sunday-satanist.jpg?w=358",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/battleship-ringo.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/10/black-eyed-boy.jpg?w=356",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/moaner-and-the-whale.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/10/black-maths.png?w=352",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/i-am-not-godzilla.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/10/osaka-samurai.jpg?w=345",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/memoirs-of-a-demon-slayer.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/spirit-house.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/05/katsu.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/07/strobelite-early-cover.jpg?w=415"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nPhase 4\nWE ARE STILL HUMANZ\n2016-2018\n\nHistory | Tours | Lore\n\nAfter three long years of inactivity, the time came to strike back and strike hard. 2017 was the largest year for Gorillaz content, not only through publicity and merchandise, but also the countless commercial tie-ins and their first studio album in seven years, Humanz. Much like Phase 2, the goal of Phase 4 was to re-establish Gorillaz as a group who could easily continue to produce innovative content whilst standing the test of time; and as evident by the wide range of content since the phase began, this comeback was beyond successful.\n\nThe phase’s first elements appeared in early-2015 when Jamie Hewlett began to tease new artwork on his Instagram account. He would continue to upload art across the year, continuing until late-2016 when it was announced that Noodle had become the Global Ambassador for Jaguar Racing. Around this time, images of the band in extreme scenarios would appear on social media, paired with their lore after Phase 3; these were each known as The Book of _____.\n\nThe band were starting to pick up the pace, dropping their first new song in five years with a music video the day prior to Donald Trump’s presidential inauguration, Hallelujah Money. Two months later, on the 23rd of March 2017 (Damon Albarn’s birthday), Humanz was announced; along with four lead singles and pre-orders for the album; all pre-orders came with a free invite to a gig at The Printworks the following day, where the full album was played live. Gorillaz would continue to rapidly pump out content prior to the album’s release, including several live interviews with the band (via motion-capture), mixes and playlists via Spotify, SoundCloud and other social media, AMA’s through Reddit, Q&A’s with countless journal sites & two brand-new apps with WMG & Telekom respectively.\n\nThe first app released was simply known as the Gorillaz app, allowing users to view the band’s house, their personal webpages and various other things to do with them. Noteworthy features this app was used for include:\n\nAn event where people could hear Humanz a week before its release at hotspots titled Humanz House Party; visiting these spots after the album’s release accessed a twelve-minute Humanz mixtape.\nThe announcement of their single, Sleeping Powder.\nA code-based puzzle that awarded players with a Jaguar application form & a certificate.\nFour quizzes based around the band members; putting the winners in a sweepstake for concert tickets.\n\nThe second app, titled The Lenz, would show Gorillaz videos and images over anything magenta that the phone camera was pointing at when in use; these included music videos, exclusive motion-capture clips, snippets of their concert at The Printworks & filtered images of the band members.\n\nGorillaz additionally did tie-ins with various other companies, including:\n\nSonos, recreating the band’s Spirit House HQ for fans to visit in real-life and creating the Crack Magazine feature, Gorillaz: Come Inside.\nRed Bull, to create a special line of cans, launching the fan club, Demon Squad & sponsoring Demon Dayz Festival Margate.\nE.ON, to build a solar-powered recording studio.\n\nOne of the largest announcements to come from this phase was possibly the relaunch of Gorillaz’ own fashion line, G Foot. The line during Phase 4 was mostly T-shirts, with occasional other fashion items like jewellery & sunglasses; G Foot also did a tie-in range with C.P. Company during this phase. There were additionally three pop-up store events to help promote the line in Brooklyn, LA (with Freak City) & London (with exclusive items like snow globes & wrapping paper). The most standout product during this phase was the band’s first ever magazine entirely dedicated to them, G Magazine.\n\nIn November, Gorillaz released a “Super Deluxe” edition of Humanz, giving them their largest (and most expensive) release to date; spanning 14 vinyl records in various colours and giving owners 34 tracks, along with an artbook. Then in December, they held a three-day takeover on Reprezent; along with an All on the Board tie-in to promote their tour.\n\nAt the end of 2017, the band created a montage of their accomplishments over the year, wrapping the phase up in mid-2018 with the final leg of the Humanz Tour and Things I Like, a podcast hosted by Russel through Deezer; walking away with a Q Award for “Best Album”, a BRIT Award for “Best British Group”, a Webby Award for “Online Film & Video – Music (Branded)” (Gorillaz x E.ON) & several Cannes Lion Awards for their app.\n\nTOURS\n\nSupporting acts: Hypnotic Brass Ensemble / Vince Staples / Danny Brown / D.R.A.M. / Little Simz / Remi Kabaka Jr. / Juana Molina / Atlas\n\nMarking their first concert in seven years, Gorillaz kicked off their comeback with a secret gig at The Printworks to celebrate the announcement of Humanz. Soon after, they played the full album live in a handful of venues across Europe, followed by the Humanz Tour. During the tour, they notably began teasing tracks from their next album, The Now Now.\n\nThe live band:\n\nKeyboards: Jesse Hackett & Mike Smith\nLead guitar: Jeff Wootton\nBass guitar: Seye Adelekan\nDrums/percussion: Gabriel Wallace & Karl Vanden-Bossche\nBacking vocals: Angel Silvera, Matthew Allen, Michelle Ndegwa, Petra Luke & Rebecca Freckleton\nLORE\n\nThe attack on Plastic Beach resulted in Gorillaz splitting up again, moments after they’d finally been reunited. Murdoc took refuge in a tiny submarine with Cyborg Noodle as his pilot. One day, Murdoc opened the hatch to take a piss, only to see EMI’s ship, The Battleship Ringo, had arrived to take Murdoc to a London prison, Dungeon Abbey. After spending three years in captivity here, Murdoc was offered a chance to make a new Gorillaz album, to balance out all the terrible artists in the industry.\n\n2D was still inside Massive Dick after the attack, killing the whale instantly from how repulsive he tasted. He then washed up on an island, resorting to eating whale blubber; as he was incapable of finding any other sources for food. After a few months, 2D realised that he’d ended up in Guadalupe, just 20 minutes by foot away from a beach rave. To 2D, this seemed like the right time to take a gap year, coming third in a wet T-shirt contest and getting a job weaving friendship bracelets. Once he was eventually fired, he flew back home, greeted with a sign at the airport that only Murdoc would’ve written for him, “Wanker”.\n\nThe attack also caused the giant Russel to flee, with Noodle in his mouth; but eventually, he reached the coast of Japan and was harpooned, dropping Noodle and losing consciousness. After drifting into North Korea, he was taken captive in Pyongyang; and displayed under the name “Pulgasari“. The food rations of North Korea led to Russel eventually shrinking back to normal size (the Glorious Leader claiming that he’d defeated Pulgasari), being sent back to England to crash on Jeff Wootton’s futon until Murdoc called to say Gorillaz were returning.\n\nAfter being swept out into Japanese waters, Noodle was plucked out by a pearl diver, becoming her apprentice to repay her kindness. One day while diving, Noodle accidentally released a shape-shifting demon called Mazuu; and was set out to stop it in whatever way she could. This led to a chase ending in Tokyo, where Mazuu was now at the top of the criminal underworld. After disguising herself as a geisha, she decapitated the demon and escaped via FedEx crate to Murdoc (history repeats itself I guess).\n\nFor the first time in roughly a decade, Gorillaz were finally together as a four-piece band again (Cyborg being given a new purpose in life; decapitated and having her head turned into a plant pot). The band’s first priority was finding a new HQ; the haunted, barely-habitable home in Detroit simply known as Spirit House. From there, they grabbed their instruments, their contact book and prepared for countless interviews all around the world.\n\nShortly after the release of Humanz, Gorillaz embarked on their second world tour, building Kong Solar Studio to bring along with them. They also kept updating their G-Mix series on a (near) monthly basis. Through social media, the band would show things they’d been up to or discovered about themselves; such as Noodle’s new pet, Katsu, and Murdoc’s interest in BDSM.\n\nThings would take a turn one day during the Strobelite video shoot, when Murdoc met a mysterious stranger who claimed to be a fan; and the pair took a selfie together. However, word soon spread this stranger was a kingpin of crime known as El Mierda, who managed to frame Murdoc for smuggling drugs, getting him arrested and thrown in HM Prison Wormwood Scrubs in November. From here, things would take another drastic turn as the band had suddenly been split up once again…\n\nTO BE CONTINUED\n\n(in Phase 5)\n\nShare this:\nTwitterFacebookPrint\nLoading..."
}