{
  "url": "https://gorillazforbeginners.com/phase-6/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2020/04/phase-6-logo.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/05/phase-6.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/10/fright-night.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/05/instagram.png",
    "https://gorillazforbeginners.files.wordpress.com/2020/03/snapchat-filter.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/04/song-machine-comic.jpg?w=745",
    "https://gorillazforbeginners.files.wordpress.com/2020/06/be-the-change.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2020/09/circle-of-friendz.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2021/11/superplastic-mini-series-case.jpg?w=750",
    "https://gorillazforbeginners.files.wordpress.com/2019/10/wish-you-were-here.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2018/05/pac-man-video.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2021/11/strange-timez-print.jpg?w=408",
    "https://gorillazforbeginners.files.wordpress.com/2021/11/the-lost-chord-print.jpg?w=1024",
    "https://gorillazforbeginners.files.wordpress.com/2021/09/anti-pop.png?w=640",
    "https://gorillazforbeginners.files.wordpress.com/2021/12/dmc.png?w=993"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nPhase 6\n2019-2022\n\nHistory | Tours | Lore\n\nThe path from phases 4-6 can be equated to the journey Gorillaz took from phases 1-3, with each phase slowly growing more in ambition and experimentation that attempted to blur the line between the virtual band and their music; and 2020 saw what could be their most experimental project to date, a series of EPs titled Song Machine.\n\nWhile very little happened during the early months, the series was teased via postcards from the cartoon band members. The band also celebrated Halloween with a Facebook Watch Party titled Fright Night, which gave fans a marathon of horror movie trailers; and a horror quiz on Instagram.\n\nSeason One of Song Machine launched on the 30th of January 2020 with a wide array of advertisements helping to promote the series; such as banners projected at Westfield London and appearances on the covers of streaming playlists.\n\nSocial media activity also saw a surge with Gorillaz launching a TikTok account, having public Q&A’s on social media with the launch of each episode and releasing filters for both Snapchat & Instagram. The band’s fan interactivity even went as far as an in-character public statement during the coronavirus pandemic; Parlophone also hosted a Quarantine Quiz about Gorillaz via their Instagram.\n\nSaid pandemic resulted in a worldwide lockdown, during which Gorillaz started a series of anecdotal telegrams via social media titled Get Lost & a Facebook group titled G Club, which they used to recommend a wide range of media to their fans during an event called 28 Day Challenge; these picks included:\n\nThe Joe Rogan Experience #1169 – Elon Musk\nThe Young Ones\nslowthai & Mura Masa – Doorman\nAkira\nMadonna – Into the Groove\nPimp: The Story of My Life\nSanto & Johnny – Sleep Walk\nParasite\nS-Town\nThe Great Beauty\nSiddhartha\nSimon & Garfunkel – 50 Ways to Leave Your Lover (from The Concert in Central Park)\nElvis Costello and the Attractions – I Want You\nBroken Record: Episode 30 – Andre 3000 and Rick Rubin In Conversation\nThe Twits\nCast Away\nElton John – Your Song\nWays of Seeing\nThe Golden Glove\nDesert Island Discs – Ian Wright, former footballer and broadcaster\nThe Brother from Another Planet\nJust Kids (Illustrated Edition)\nHomo Ludens / Madness and Civilization: A History of Insanity in the Age of Reason / The Mind in the Cave: Consciousness and the Origins of Art / The Hand of Destiny: Folklore and Superstition for Everyday Life / Tibetan Yoga: Principles and Practices\nFleetwood Mac – The Chain\nFifty Shades of Grey\nGoodFellas\nRunning on Empty\nGorillaz feat. George Benson – Humility\n\nAs the UK began to ease out of lockdown, Gorillaz took part in a “#BILLBOARDPOSITIVE” campaign to help boost public morale. Shortly after this, the band took a stand following the death of George Floyd; teaming up with The Black Curriculum and starting the “Be The Change” campaign with a range of clothing and a website linking several informative podcasts, articles, books, videos, Instagram accounts, petitions, donation links & guides to help people taking part in the protests.\n\nEventually, the decision was made to compile Season One’s songs onto a studio album (Song Machine, Season One: Strange Timez) which was announced on the 9th of September; alongside the single, Strange Timez & a membership pass titled Circle of Friendz, which gave fans early access to concert tickets and merch drops.\n\nSeason One’s release was celebrated in tandem with the band’s 20th anniversary; with an almanac, a four-part radio show on Apple Music 1 titled Song Machine Radio & a live Q&A on YouTube titled Song Machine with Friendz which involved Damon Albarn and several of the album’s collaborators.\n\nMerchandise from this period included hot sauce, calendars, a series of art prints, T-shirts, sticker sheets & a series of figures by Superplastic. The phase also saw a surprise return to the band making online minigames with Aries Driving Game.\n\nWith Season One over, the band charged into 2021 by channelling their focus into celebrating their two decades of work with a boxset of the major LP’s titled G Collection: The Studio Albums, a second boxset dedicated to Phase 1 titled Gorillaz: 20th Anniversary Super Deluxe Vinyl Boxset & an EP titled Meanwhile…; which was released to celebrate the Notting Hill Carnival (only for the event itself to be cancelled).\n\nThe band’s clothing range widened with the second relaunch of G Foot, a Fred Perry range & several collections sold via their online store; the Bonesy Collection also included stress balls, car fresheners & a wooden thumb toy. Gorillaz decided to wrap up 2021 with a one-night theatrical rerun of a Song Machine Live From Kong performance from the year prior. The following year, Superplastic continued to expand their Gorillaz range with a blind box collection of various characters from several different phases; Gorillaz also announced a range of semi-permanent Inkbox tattoos & their own artbook, but the latter’s release was delayed due to a paper shortage.\n\nDespite all the unexpected odds thrown at them, Gorillaz managed to shine through the darkness like a beacon and continued their usual rate of content output during one of the most turbulent periods in modern history. While Season Two didn’t directly follow this era, the band would return to making concept albums with their next project; leaving this period of their career with a Webby Award for “People’s Voice Winner – Advertising, Media & PR Game or Application” (Aries Driving Game).\n\nTOURS\n\nSupporting acts: Cadenza\n\nCOVID-19 stunted the potential for a tour in 2020, so live performances (as limited as they were that year) were restricted to livestreams, including a three-show event titled Song Machine Live from Kong; which allowed fans to watch the band performing their latest songs via LIVENow. Some noteworthy performances during the streams included Clint Eastwood (Ed Case/Sweetie Irie Refix) & Fire Coming Out of the Monkey’s Head with Matt Berry.\n\nThe live band:\n\nKeyboards: Jesse Hackett & Mike Smith\nLead guitar: Jeff Wootton\nBass guitar: Seye Adelekan\nDrums/percussion: Femi Koleoso & Karl Vanden-Bossche\nBacking vocals: Adeleye Omotayo, Angel Silvera, Matthew Allen, Matt Maijah, Michelle Ndegwa, Petra Luke & Rebecca Freckleton\nLORE\n\nAfter dealing with prison, crime lords & aliens (a casual Tuesday for Gorillaz), the group split off to go travelling. Noodle visited Lake Urmia to take in the sights, 2D headed back to Beirut, Murdoc went clubbing in Ibiza & Russel flew to Mexico to make hot sauce.\n\nOnce they regrouped, it was back to making music; this time creating a new London-based Kong Studios (with its own portal in their basement to take them wherever they wanted) and nixing any plans on albums to free up their creative flow. “The machine” was finally ready and unveiled to the world as Song Machine. As the project started, Murdoc took to Twitter with the thread series, Debunked with Murdoc Niccals; where he frequently answered questions the fans had from watching the band’s music videos (until Russel hosted his own “Rebunked” session to call out Murdoc’s bullshit).\n\nThe COVID-19 outbreak left the band stuck indoors, keeping in touch with fans via a series of telegrams they referred to as Get Lost with Gorillaz. They were kept busy with the launch of G Club, Reddit AMA’s & the continued output of Song Machine episodes (during all this, Murdoc tried to build a makeshift portal for himself). While nobody was able to visit them at Kong, they weren’t alone. Much like the old Kong Studios, their new HQ was haunted by a mysterious spirit known as “The Pink Phantom”. It came out of hiding during lockdown, which drove Murdoc to try catching it by setting up a trap…\n\nMeanwhile, the band would continue travelling via whatever means were available; Russel visited Hackney to mass-produce his own brand of hot sauce, the group took their portal to Lake Como (without Murdoc), they went for a drive through Morocco (followed by a punch-up after Murdoc tried to stick 2D with a truth serum) & they piloted their new spacecraft, the SS Winnebago Humility III to the moon. Eventually, the Pink Phantom ended up in the trunk of their car; and they were thrown through a portal to Vinewood when they decided to go for a drive. Before you could say “cease and desist”, the band were shot through another portal which unexpectedly led them to Plastic Beach…\n\nUpon their arrival, they were greeted by 3 unexpected faces, Cyborg Noodle (still in the submarine Murdoc had used to escape the island a decade ago), Daley’s skeleton & a humongous sea creature that proceeded to blow up the entire island with its laser eyes. The Pink Phantom escaped the trunk, leaving the band behind as the carnage began to unfold on what was left of Plastic Beach. The blasts also shook Cyborg’s submarine off the shore, causing it to sink into the deep abyss; with her still inside. In the last fleeting moments before the island was completely submerged, a portal opened up allowing the band to escape back home. What did any of this have to do with anything? Fuck knows, but it looked amazing!\n\nThe following year gave the band time to wind down, channelling their efforts into celebrating their 20th anniversary through playlists, mixes, boxsets & the brand-new EP, Meanwhile…; these celebrations coincidentally occurred while an organisation known as the Department of Music Correction were able to de-classify sensitive documents from Gorillaz’ past…\n\nA whistle-blower within the DMC (known only as “Gflat”) decided to take advantage of a spike in attention the organisation received upon their announcement of a Gorillaz boxset; which contained various unseen documents surrounding the band’s early years. This hype period gave Gflat the encouragement to share incriminating documents via LinkedIn; an action that other DMC members took issue with, until he was finally discovered and fired from the company.\n\nTO BE CONTINUED\n\n(in Phase 7)\n\nShare this:\nTwitterFacebookPrint\nLoading..."
}