{
  "url": "https://gorillazforbeginners.com/phase-3/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2023/03/phase-3.jpg?w=500",
    "https://gorillazforbeginners.files.wordpress.com/2019/02/phase-3-group.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/04/plastic-beach-model.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/01/pirate-radio-shows.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/06/escape-to-plastic-beach-game.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/02/plastic-beach-qr-code.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/06/sub-division.png",
    "https://gorillazforbeginners.files.wordpress.com/2020/01/stylo-toy.png?w=300",
    "https://gorillazforbeginners.files.wordpress.com/2018/06/ielectribe-gorillaz-edition.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2019/05/the-white-helmets.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/03/plastic-beach-anniversary.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/run-down-kong.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/postcard.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/kidnapping-bobby.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2023/03/stylo-video-shoot.jpg?w=956",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/the-sun.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2020/02/russels-note.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/09/murdoc-vs-the-band.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/noodle-phase-3.jpg",
    "https://gorillazforbeginners.files.wordpress.com/2018/08/the-evangelist.jpg"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nPhase 3\nESCAPE TO PLASTIC BEACH\n2009-2012\n\nHistory | Tours | Lore\n\nIf any period in Gorillaz’ career could be considered their most promising, but simultaneously their least fortunate, it’d be Phase 3. It had been described by Jamie Hewlett during production as “a movie that will never make it to the cinema ‘cos it doesn’t have to, because it’s gonna be in everybody’s heads”; sadly, this ambition was never fully realised. The original plan was to release several music videos that told an ongoing story across two studio albums, with an additional album made up of leftovers from the recording sessions; as well as a second autobiography titled The Sinking of Plastic Beach. By the end of 2012, we only saw one of these albums (Plastic Beach) and two of the videos (plus storyboards for the third); there were even plans to release a “Super Deluxe” edition of Plastic Beach with two discs. The reasoning for it all going up in smoke mostly came down to the budget, with a thirteen-foot model built for teasers and album covers, the Stylo video & over two hundred songs recorded with numerous collaborators. Damon & Jamie had no choice but to pull the plug because budget had dried up, resulting in a falling out & a subsequent three-year hiatus.\n\nThe phase began production as a non-Gorillaz project, similar to Monkey: Journey to the West. It was titled Carousel and would have been a collab-heavy mix of live action & animation. This eventually evolved into a Gorillaz project with Damon Albarn playing three new demos via a Radio One takeover on Zane Lowe’s show in January 2009 (Stylo, Broken & Electric Shock). In January 2010, a teaser titled Reflection was released online, announcing the next Gorillaz album, Plastic Beach. This was soon followed with Murdoc hosting four pirate radio shows on the Gorillaz website over the following two months, takeovers on Xfm’s Residency & The Guardian; and the lead single, Stylo being released. On top of all this, journalists in Australia were offered a range of decorations (created by Gavin Chimes) known as Plastic Flowerz, along with a letter from Murdoc and a USB stick containing Plastic Beach, a “Surveillance Report” PDF, several teaser trailers & artwork to promote the album.\n\nThe album was promoted primarily through the lore, retooling the Gorillaz website into a point-and-click adventure game around the island, accompanied by various flash games based on the music videos. Along with these, there was also a mobile game by Matmi titled Escape to Plastic Beach. Another app was released to serve as a news feed; and featured an AR model of Plastic Beach, accessible through a code in the Republic of Plastic Beach Passport that came with an issue of NME. The band also did a tie-in with O2 to promote their Priority offers; as well as hosting a Facebook Q&A with Murdoc.\n\nGorillaz also began a fan club titled Sub Division. The club began selling new merchandise, including shirts, lithographs, badges, postcards, greeting cards, a mug, a tote bag & patch sets; as well as having exclusive concerts for their members. A toy Stylo car was also planned as a club-exclusive product, but never got released.\n\nThe original plans for Phase 3 had begun to make a u-turn in November 2010 when the band released a new single, Doncamatic. The group also ran several contests, including a scavenger hunt on their website to win a one-of-a-kind surfboard; and a sweepstake to win gig tickets, with one winner receiving an “Ultimate Fan Prize Pack” (a tour shirt, poster, VIP pass replica & a Flip Video camera).\n\nGorillaz began their first world tour, with Damon recording new songs during the American leg on his iPad. These songs would eventually be released exclusively through Sub Division on Christmas Day later that year for free as a studio album, The Fall; as the final gift on a digital advent calendar. On top of all this, they started a contest with the help of Internet Explorer 9 for fans to design a new character, the Evangelist.\n\nOnce the budget had run out, the pair continued into 2011, producing work with a significantly lower amount of required effort; with two more pirate radio shows hosted by Murdoc, a commercial release of The Fall, a “Gorillaz Edition” of the KORG iELECTRIBE app, another Xfm takeover to celebrate their tenth anniversary & a compilation album titled The Singles Collection 2001-2011.\n\nIn early-2012, Gorillaz made their last appearance before the hiatus with a tie-in single, DoYaThing; as part of Converse’s 3 Artists 1 Song series; this collaboration also allowed Gorillaz to release their own line of Chuck Taylor All-Stars, a handful of repurposed 7″ records they used to promote the range & a final series of pirate radio transmissions from Murdoc. After the phase ended (but before the next one began), the song, Crashing Down was featured in the 2016 film, The White Helmets.\n\nIn the end, Phase 3 gave fans a lot; enough for the fanfare to warrant a range of merchandise in 2020 to celebrate Plastic Beach’s tenth anniversary. It was the most ambitious phase at the time, but tragically turned into an Icarus flight; with the full vision never being brought to life. However, regardless of what hadn’t been accomplished, Gorillaz still ended up winning a GAFFA Award for “Best Foreign Video” (Stylo), a GQ Award for “Band of the Year”, an MVA for “Best Animation” (On Melancholy Hill) & two MDA’s for “Artist of the Year” & “Best Artist Promotion” (the Escape to Plastic Beach mobile game).\n\nTOURS\n\nSupporting acts: N.E.R.D / Little Dragon / De La Soul\n\nThe Escape to Plastic Beach World Tour was the band’s first ever world tour, marking their first live performance in Australia, their first gigs at Coachella, Glastonbury & a show in Damascus; making Gorillaz the first major western band to play in Syria. Unfortunately, the tour’s cost resulted in Damon Albarn making barely any profit from it; contributing to Phase 3’s sudden demise.\n\nThe live band:\n\nKeyboards: Jesse Hackett & Mike Smith\nLead guitar: Jeff Wootton & Simon Tong\nBass guitar: Paul Simonon\nRhythm Guitar: Mick Jones\nDrums/percussion: Cass Browne & Gabriel Wallace\nStrings: Demon Strings\nLORE\n\nAfter the band disbanded in 2006, Murdoc went on a three-year bender. Once he started to run out of money, he naturally chose an immoral route; selling dud weapons to underground crime rings worldwide. One group particularly thirsty for blood were The Black Clouds, pirates who Murdoc had cheated in the past; leading to them going after him for years. In fact, they actually replaced the dud helicopters during the El Mañana video shoot (meaning that Noodle was being gunned down with real bullets at the time). Murdoc rushed back to the decimated Kong Studios one last time on the 25th of July 2008 and hastily burnt it down for insurance money (putting the blame on random kids), preparing for his most ambitious plan to date…\n\nArriving at Point Nemo, Murdoc used his newfound windfall to build a new HQ, the garbage-cluttered, tar-glued nightmare he now called “Plastic Beach”. After building a mansion on top of the landfill land mass, work started on a new album. Murdoc kicked things off by building his own personal bodyguard/guitarist/collaborator kidnapper with Noodle’s DNA, scraped from the El Mañana crash site; Cyborg Noodle. Retrieving 2D was also on Murdoc’s to-do list, which simply required going to his home in Beirut and gassing him. 2D woke up on the island and had no choice but to comply, with Murdoc keeping him in a room below sea level; taking advantage of 2D’s cetaphobia by hiring a whale to keep him from escaping.\n\nAfter a promotional run where Murdoc hosted his own pirate radio show, footage of the trio was released for the Stylo video; where not only were they almost gunned down by Bruce Willis in a desert, but there was also a mysterious entity lingering in the footage known as “The Boogieman”. The Boogieman was said to be pure evil, an ominous being whom Murdoc had previously made bargains with in the past. Whatever the reason for his arrival now, Murdoc wasn’t happy about it. The chase with Bruce ended with the band crashing into the ocean, as their Camero transformed into a submarine for the last leg of the trip back to Plastic Beach. Their deep-sea journey saw each collaborator from the band’s new album join them towards the new Gorillaz HQ. Only to be met with the Boogieman again (killing a manatee). Despite these run-ins, they all made it to Plastic Beach and marketing for the band continued as usual, with Murdoc at the front seat every step of the way.\n\nMeanwhile, Russel had gone in his own direction, struggling with a hoard of inner demons that drove him to dive straight into the sea; swimming out to try and escape the spirits trying to get the better of him. Bizarrely, the further he swam, the larger he grew…\n\nGorillaz were preparing to go live again, this time putting Damon Albarn & his live ensemble on stage with Murdoc, 2D & Cyborg. However, the Coachella gig didn’t go as planned, with Murdoc being deported back to Plastic Beach because of a missing work visa; moments before the show was about to start. At the Camden Roundhouse, Murdoc was once again pulled from setting foot on stage due to a misplaced passport. The continuous praise Damon was getting for gigs where the actual band were meant to be the focus started to enrage Murdoc, soon the live band began preventing Gorillaz from attending their own stages. Murdoc’s thoughts started turning to murder, but soon he felt contempt towards these feuds when Gorillaz were announced to perform at Glastonbury.\n\nAs for Noodle, the former-guitarist was found on a ship, being gunned down again by pirate jets. After attempting to fight back, she was forced to abandon ship in a life raft; until out of nowhere, Russel swam past her, now the size of a titan due to both the radiation in the sea & the shrimp he ate on the way (not like this was his first time being a giant). The pair teamed up and started to journey towards Plastic Beach for whatever reasons they had (reasons never explained).\n\nHeading into Christmas, Gorillaz released a new album that 2D had recorded while the band were touring America, The Fall. The album soon got released to the general public in 2011, with Murdoc hosting another pirate radio show to commemorate this.\n\nEventually, things would intensify when the Boogieman summoned Damon’s live band, leading to a full-on assault against Plastic Beach. While Cyborg attempted to lead a fully-armed charge with the collaborators, Murdoc attempted to confront the Boogieman mano a monster. All the while, 2D was pissing himself as a white whale (known as Massive Dick) was now attempting to attack him, swallowing 2D whole. Suddenly, a giant hand grabbed the whale, hurling it into the sky as it crashed into some more pirate jets; it was Russel! Noodle appeared from inside his mouth, revealing a bruised eye and a look that could kill.\n\nThis ungodly dysfunctional & contextually awkward family reunion was cut short as the Boogieman was still relentlessly summoning forces to destroy the island. With everything being shot to pieces in a war that made Marvel’s biggest hit films look tame in comparison, the group only had one option left, bail…\n\nTO BE CONTINUED\n\n(in Phase 4)\n\nTHE ORIGINAL ENDING\n\nThe Phase 3 lore splits into two paths, originally ending with the following development from 2011 to 2012. In 2016, this section was erased from continuity for Phase 4 to take the story in a new direction. The portion beneath this paragraph is non-canonical.\n\nDespite the odds stacked against them, Gorillaz persevered in fending off the Boogieman with a decoy Murdoc lookalike; until suddenly, their saviour arrived. This being was considered the yang to the Boogieman’s yin, the embodiment of all good and the being who wiped out everyone attacking Plastic Beach, the Evangelist.\n\nThe Boogieman wasn’t the only casualty during this conflict, as Noodle destroyed her Cyborg counterpart; as she’d malfunctioned in the chaos, trying to kill Murdoc. As the dust settled, it was decided that a shot-up, smelly, murky hunk of junk in the middle of the ocean didn’t have ideal living conditions; so the reunited band left for a new home in London.\n\nMoving to 212 Wobble Street, Gorillaz’ activity began to wind down, with Murdoc moving his pirate radio booth from Plastic Beach’s lighthouse to a cupboard under the stairs. The crew celebrated their tenth anniversary, followed shortly with a Converse tie-in that included one final single from them (thanks to Murdoc stealing a demo from André 3000). Things were finally relaxed until one morning, when 2D was on his way to work (at Sudden Impact Driving School), he was handed an eviction notice; leaving the band’s fate up in the air…\n\nTHE END?\nTHE SCRAPPED ENDING\n\nPhase 3’s lore was originally intended to go in the direction written below, with their budgetary struggle preventing them from ever depicting this ending.\n\nWhilst on Plastic Beach, Murdoc noticed a mysterious book that had swept up on the shore, titled The Book of M.A.N.. This book consisted of thirteen chapters, these being:\n\nThe Big Bang: History & Creation of the Universe. Black Holes, Dark Matter, Primordial Soup\nEarth\nFire, the Wheel & the Gun. Religion, Magic & the Beginning of Fame\nRomans & Greeks\nThe Middle Ages\nIndustrial Revolution\nBritish Empire\nAmerica & the Rise of the West\nWorld Wars I & II\nPunk Rock\nEverything, All the Time Forever\nThe Plastic Beach\nThe End of Days\n\nThe book chronicled the history of the universe, pointing out the gradual increase in speed when it came to the evolution of society and the simultaneous increase in war over the 20th century. However, Murdoc noticed that he actually appeared in each chapter, Chapter 12 was about his arrival on Plastic Beach; and Chapter 13 had been ripped out.\n\nThe final chapter of the book was split into several pieces of a map of Plastic Beach. When they were to be stitched together (completing the chapter), Plastic Beach would be pulled from the ocean by a giant hand, the island itself being chained to a plug at the bottom of the sea; causing the plug to come out and the entire universe as we know it to end up getting washed down the drain.\n\nTHE END\n(OF THE WORLD)\nShare this:\nTwitterFacebookPrint\nLoading..."
}