{
  "url": "https://gorillazforbeginners.com/spoken-word-2/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2020/03/we-are-the-dury.png"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nSpoken Word\nWe Are the Dury\n\nRelease date: April 2005\n\nJust like The Apex Tapes, this CD was given to radio stations for hosts to interview the band; but this time the questions dug deeper into the band’s lore and the meanings behind each track from their then-latest album, Demon Days.\n\nTracklist:\n\nIntro.  “The Gorillaz story is now something of a legend. The take of a world-storming band, composed of the four musicians: Murdoc, Russel, Noodle and 2D. Their ascent to stardom was swift, drafting in superlative collaborators to record their award winning debut album ‘Gorillaz‘, a fantastic collision of dub reggae, punk and hip-hop. This was accompanied by a relentless array of top-notch videos and Gorillaz subsequently won countless awards around the globe. Having been nominated in five categories, Gorillaz then gave a breathtaking performance at the 2002 Brit Awards show. This was rounded off with an extensive Gorillaz American Tour.\n\nHowever, since then there has been only silence from the Gorillaz camp. Now, as they prepare to release their new album, we’ve been given the opportunity to ask them what happened and discover what they’ve been up to since their last appearance.”\n\n[untitled]\nSo, where have you been and what have you been up to?\n2D, what did you do in your off time?\nYou recorded most of the album in your own Kong studios. How did you first find this building?\nYour website, Gorillaz.com, gives your online audience access to Kong Studios. Tell us about the thinking behind this.\nOK, Murdoc, you’ve had your ciggy and you’ve got your beer. Let’s get down to it and talk through the new album. How long did Demon Days take to record?\nLet’s now go through the album track by track. First up, suitably enough, Intro.\nTrack 2 is Last Living Souls. Russel?\nNext up, Kids with Guns. A slower track, yes?\nTrack 4, O Green World. Noodle, talk us through this one, please….\nLet’s talk about the collaboration with DJ Danger Mouse. Was he involved on the next track, Dirty Harry?\nNext is the first single, Feelgood Inc.\nEl Manana is next, Spanish for ‘tomorrow’, I believe.\nNext track is Every Planet we Reach is Dead. Sounds a bit sinister….\nOK, November has come. Russel, can you start us off on this one?\nAll Alone follows, Track 10 on the new Gorillaz CD Demon Days.\nNext up, White Light.\nThere’s an interesting story about how the next track, Dare, got its title….\nNoodle, tell us about Fire Coming out of a Monkey’s Head\nBack to you, Russel, for Don’t Get Lost in Heaven\nNow, the title track, Demon Days. Noodle?\nOK, those are the tracks covered. How would you say this new record differs from the first Gorillaz’ album, Russel?\nWho chose the single?\nThere are a number of guest collaborations on the album. How did they come about?\nAre you going to tour this album?\nDid you ever feel that the first album would be as successful as it actually was?\nBut why, do you think, it was so successful?\nWhen did you know that you had really arrived as celebrities?\nHave you, finally, learned anything from your experience?\nRise of the Ogre\n\nRelease dates:\n\nPart I: 5th December 2006\nPart II: 12th December 2006\nPart III: 19th December 2006\nPart IV: 26th December 2006\n\nNarrated by Joss Ackland (and the band), this series of audiobook singles covered the prelude & Chapter 2 of the autobiography, Rise of the Ogre (abridged, despite the titles of each single).\n\nEpisodes:\n\nPart I (Unabridged)\nPart II (Unabridged)\nPart III (Unabridged)\nPart IV (Unabridged)\nShare this:\nTwitterFacebookPrint\nLoading..."
}