{
  "url": "https://gorillazforbeginners.com/spoken-word/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2020/05/the-apex-tapes.jpg"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nSpoken Word\nThe Apex Tapes\n\nRelease date: March 2001\n\nThis CD was given to radio stations so they could interview the band members, with questions listed in the case that radio hosts would ask before playing the corresponding answers. These interviews were the first time the band’s speaking voices had ever been heard.\n\nTracklist:\n\nWe’re here with Gorillaz…..introduce yourselves, if you will.\nDid you consider any other names before deciding on Gorillaz?\nIs the connotation of cultural guerrilla warfare intended or do you come in peace?\nWhat was it about 2D that made you confident he’d be a great singer, Murdoc?\nSo how did you get the record deal then. I believe it all happened quite quickly?\nMurdoc, you mentioned the gig at the Camden Brown House, which is now legendary, partly cos there was a bit of a ruck, but there haven’t been many subsequent lives shows, why is that?\nOne of the things people find fascinating about the band is that you have a base down in south Essex, so what do you get up to down there?\nA lot of people have been complaining about the manufactured nature of British pop lately and some people have suggested you’re actually part of that. What’s your take on how you fit into the current scene?\nSo you’re all into different styles of music. Murdoc you like a bit of death metal and dub. Russel, your thing’s hip hop. Noodle you’re into rock axe heroes. 2D likes some 80s pop things, so how do you make all those different tastes fit together?\nOne journalist has described the Gorillaz sound as ‘Ghetto ghost punk beatz’ and also a “sensi’n’bongo riffed simultaneous requiem and eulogy for pop,” are those remotely accurate?\nCan you each nominate two heroes either musical or not, just so we know a bit about where you’re coming from?\nAre you into a full blown experimental approach, going the path same as Radiohead for example?\nStoopid grooves are big on the record, is stupid the new clever when it comes to music?\nYou were just on the cover of Dazed and Confused before you’d even had a hit so there’s already talk of hype, doesn’t that concern you?\nSome bands seem to view the charts as a gladiatorial arena, do you feel you’ve got to put a few current artists to the sword?\nWell which artists get the thumbs down then?\nUnder what circumstances was the album recorded?\n5/4 is a great stomping tune with a lyric that says “She killed my daddy” and then “She made me kill myself” what’s all that about?\nThe single ‘Clint Eastwood‘ has a reggae rap feel to it, kind of Augustus Pablo meets Melle Mel, do you think that psycho geographically the record’s located between North and South America… maybe like Costa Rica perhaps or Aruba in the Southern Caribbean, maybe?\nWhat’s the story behind the ragga style Ed Case remix?\nPunk and M1 A1 on the other hand display affection for British towerblock punk, are you nostalgic for those days at all?\nJoe Strummer or Malcolm McLaren: who got it right?\nRock The House is a funky dance thing with another fine rap from Del but it’s at odds with your Ibiza/superclub/superstarDJ/Garage tendency in dance music, so what do you think of the state of club music for the masses?\nLatin Simone has a bit of an amorous Cuban ballad feel, what’s the story behind that tune and whose this Simone bird?\nHave you thought about Chat-back?\nM1 A1 is the last track on the album and it has a voice shouting “Hello! Is anyone there?” against an early phase Howard Devoto-esque riff and a distinctly JG Ballard backbeat, how did that all come about?\nYou have Japanese, American, and Brit members so you’re a bit global. Do you reckon you have an edge on your average sedentary pop group?\nCan you explain a bit how the inner band personality dynamics work because some people have got the impression that you hate each other?\nBut Russel was quoted as saying working with Murdoc was like working with an ‘opportunistic Nazi’, isn’t that a heavy criticism?\nIs it important that Gorillaz make it big out of the UK? Do you want to be big in America?\nDo you feel confident that you can go head to head with Limp Bizkit?\nSome people out there are saying Gorillaz are not 4 real, that you are, in fact a bit of a cartoon band, does that upset you?\nWhat would you regard as the pinnacle of success for Gorillaz?\nMurdoc One to One –\n\n34. What were your previous musical activities before Gorillaz?\n35. You share a place of birth with Lemmy from Motorhead, also born in Stoke, and known for his taste in fast women, cars and pharmaceuticals. Do you think you have much in common with him?\n36. Hello came round to do you in your bedroom, what would be the main features of interest?\n37. If you sell a million copies of the Gorillaz album what are you going to spend the money on\n38. Is there a spiritual side to you?\n39. Do you want the kids to look up to you?\n\n2D One to One –\n\n40. Which singers inspired you?\n41. How did you get the name 2D?\n42. You were in a coma can you explain what effect that had on you?\n43. Do you not resent Murdoc for his actions back then because he nearly killed you?\n44. The press has been calling you ‘the face of a generation’. Does that put a lot of pressure on you?\n45. Does it concern you that your artistic credibility might be compromised by your visual uniqueness?\n46. If you were Prime Minister for a week what would you change about Britain?\n\nRussel One to One –\n\n47. Do you think Gorillaz is more British or American influenced?\n48. Who would you like to work with outside of Gorillaz and why?\n49. Is liking Chaka Khan something from your childhood or does she just kick ass?\n50. Is hip hop in a good phase right now?\n51. What phase in the evolution of hip hop do you connect with the most?\n52. Why is someone with your education doing music as opposed to say, a career as a diplomat?\n53. Do you think if Coldplay spent a month in Brooklyn High it might help with their music?\n54. What is your favourite item of clothing at the moment?\n55. If you left Gorillaz would the band be able to carry on?\n56. What song on the album are you most proud of and why?\n57. Is there anyone out there who can compete with Gorillaz?\n58. Do you expect a long career as a Gorilla or is the band chemistry too volatile?\n59. What’s the most important thing that people understand about Gorillaz?\n\nNoodle One to One –\n\n60. Jimmy Page or Graham Coxon? Who rocks the most?\n61. Is the cynical marketing of pre-designed lifestyle via fashion, sport, and music ripping off the kids or enriching their lives with the magic bounty of global capitalism?\n62. Do the teachings of Lao Zi influence your playing\n63. What’s the most tiresome thing about being in Gorillaz?\n64. 2D and you hang out a lot, do you have a lot in common despite the cultural divide?\n65. Is the British pop scene more or less interesting that the Japanese one?\n66. Does the idea of becoming famous mean anything to you or are you on a higher and more Zen coated plane?\n\nIdents –\n\n67. Radio ident\n68. Clint Eastwood (Murdoc ident)\n69. Clint Eastwood (Russel & Noodle ident)\n70. Clint Eastwood (Murdoc & 2D ident)\n71. 5/4 (Murdoc ident)\n72. 5/4 (2D ident)\n73. 5/4 (2D, Russel & Noodle ident)\n\nShare this:\nTwitterFacebookPrint\nLoading..."
}