{
  "url": "https://gorillazforbeginners.com/the-band-members/",
  "imageUrls": [
    "https://gorillazforbeginners.files.wordpress.com/2018/05/cyborg-noodle.png",
    "https://gorillazforbeginners.files.wordpress.com/2018/05/ace.jpg?w=310"
  ],
  "textContent": "Skip to content\n\nGorillaz for Beginners\n\nA fan site for Gorillaz with all the basics!\n\nPhase 1\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 2\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 3\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 4\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 5\nMusic\n \nVideos\n \nBooks & Magazines\n \nArtwork\n \nPhase 6\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nPhase 7\nMusic\n \nVideos\n \nBooks & Magazines\n \nSpoken Word\n \nArtwork\n \nAssociated Projects\nSpacemonkeyz\n \nMonkey: Journey to the West\n \nGorillaz Sound System\n \nKong Solar Studio\n \nGorillaz x Reprezent\nThe Band Members\n\nCurrent Members | Former Members\n\nCURRENT MEMBERS\nMurdoc Niccals\n\nBorn: 6th June 1966\n\nVoiced by: Phil Cornwell\n\nThis green-skinned Satanist from Stoke-on-Trent is the band’s head-honcho, forming the group and playing bass for Gorillaz from 1998 to late-2017, returning in late-2018. He’s musically influenced by various Rock artists, he once built his own paradise in the middle of the ocean and has committed countless crimes over the years; at one point even creating an online campaign to try and escape from prison. By himself, he’s hosted a series of pirate radio shows and ran the short-lived Twitter thread series, Debunked with Murdoc Niccals.\n\n2D\n\nBorn: 23rd May 1978\n\nVoiced by: Nelson De Frietas (2001-2017) | Kevin Bishop (2017-Present)\n\nOften Murdoc’s punching bag, Stuart “2D” Pot is the eyeless, clueless and front-toothless keyboard player/vocalist of Gorillaz. His most noteworthy traits and accolades are a painkiller addiction, his obsession with Electronic music and having a relationship with Rachel Stevens (that Murdoc quickly ruined). By himself, he’s made the album, The Fall and the single, Sleeping Powder; along with hosting The Stuart Potcast.\n\nRussel Hobbs\n\nBorn: 3rd June 1975\n\nVoiced by: Remi Kabaka Jr.\n\nNothing screams “paranormal” like Russel’s own life experiences, namely being possessed by a dead friend; which turned his eyes completely white. The American Hip-Hop enthusiast was kidnapped into being the drummer for Gorillaz from 1998 to 2006, returning in the mid-2010’s. In his lifetime, he’s met the Grim Reaper twice, he’s become a giant and he’s even been displayed in North Korea as an attraction. By himself, he’s hosted the podcast, Things I Like by Russel; as well as releasing his own condiment range, Hobbs Hot Sauce.\n\nNoodle\n\nBorn: 31st October 1990\n\nVoiced by: Haruka Kuroda (2001-2016) | Haruka Abe (2018-Present)\n\nNoodle became Gorillaz’ guitarist when she was just eight years old, arriving in a FedEx crate and only speaking Japanese. A trip to Japan eventually revealed her shady past, returning a hidden fluency in English and opening her eyes to the dangers of the world around her; primarily the filth that mainstream audiences are exposed to in media. She was part of the band from 1998 to 2006; returning in the mid-2010’s and drawing influence from contemporary female artists. She’s also been the Global Ambassador for Jaguar Racing.\n\nFORMER MEMBERS\nCyborg Noodle\n\nBuilt: 2009\n\nBuilt by Murdoc, Cyborg was a clone of Noodle made to take her place as the band’s guitarist from 2009 to 2011; doubling as Murdoc’s bodyguard. She was mute, obedient to her creator and (quite literally) armed to the teeth with guns. It was believed that Cyborg was eventually dismantled, with her severed head being used as a plant pot at the band’s HQ; however, this was later contradicted when she was seen sinking to the bottom of the ocean in a small submarine.\n\nAce\n\nBorn: 1980 or 1981\n\nFollowing Murdoc’s arrest, Ace took his place as the band’s bassist in 2018; leaving once Murdoc returned. He’s an asshole, he has green skin and if he were a little more vicious towards his bandmates, it’d almost feel as if Murdoc had never left.\n\nShare this:\nTwitterFacebookPrint\nLoading..."
}